<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
             "http://www.w3.org/TR/REC-html40/loose.dtd">
<HTML>

	<HEAD>
	      <TITLE>La Hacker FAQ</TITLE>
	</HEAD>

	<BODY>

<p>
<font size="-1">
<u>note du traducteur:</u> dans ce document vous ne trouverez pas les termes
anglais francis&eacute;s &agrave; outrance que l'on peut voir &agrave; certains endroits. Par
exemple dans la conversation courante en France on entend &#34;hacker&#34; et
non pas je ne sais trop quelle traduction. J'ai employ&eacute; ces termes, qui font
partie du langage courant actuel de la France. J'en prend la
responsabilit&eacute;.</font></P>
<!-- Made with Emacs -->


		<P>La liste qui suit est une tentative de faire face &agrave; ce qu'il
		arrive invariablement lorsque des gens sans exp&eacute;rience
		pr&eacute;alable de la communaut&eacute; hacker essaient d'embaucher un
		hacker.
</P><P>
		Cette FAQ est librement distribuable et copiable. C'est une des
		toutes premi&egrave;res versions. Si vous voulez modifier cette FAQ
		ou l'utiliser dans une publication, veuillez contacter l'auteur.
		L'auteur est
		<A HREF="mailto:seebs@plethora.net">seebs@plethora.net</A>.
		Le site original de distribution (pour la version 0.04) est
		&#34;<A HREF="http://www.plethora.net/%7Eseebs/faqs/hacker.html">http://www.plethora.net/~seebs/faqs/hacker.html</A>&#34;.</P>

		<P>Si vous trouvez ces informations utiles, veuillez penser &agrave;
		une donation en faveur de l'auteur ; un email pour plus de
		renseignements.</p>

		<p>ATTENTION: L'auteur est un hacker. La subjectivit&eacute; est
		in&eacute;vitable.</P>

		<p>Ce document est copyright (c) 1995, 1996, 1998 par Peter
		Seebach. La distribution sous forme non-modifi&eacute;e est
		autoris&eacute;e.</P>
		<p>Pour la traduction fran&ccedil;aise:
		<a href="mailto:gcottenc@altern.org">Guillaume Cottenceau</a>, le 08.21.1999</P>
		<p>Version 0.04 - Derni&egrave;re modification: 09.07.1998</P>

		<H3>Questions et R&eacute;ponses:</H3>
		<H3><A NAME="partie-0"></A>Partie 0: Comprendre les bases.</H3>

		
<DL> <DT><A NAME="question-0.0"></A>0.0: Est-ce que mon hacker ne
			va pas pirater mon ordinateur et voler mes secrets
			industriels?
		</DT>
  <DD>Non. Les hackers ne sont pas, au contraire de ce que les m&eacute;dias avancent 
  en g&eacute;n&eacute;ral, ceux qui piratent les ordinateurs. Les pirates
  sont appel&eacute;s des &#34;crackers&#34;.
  <p>
  Les hackers sont des gens qui aiment jouer avec les ordinateurs. Votre hacker
  pourrait &agrave; l'occasion contourner des dispositifs de s&eacute;curit&eacute;, mais ce
  n'est pas avec l'intention de nuire ; il le fera seulement lorsque la s&eacute;curit&eacute; 
  se met en travers de son chemin, ou parce qu'il est curieux.
  </P></DD>
  <DT><A NAME="question-0.1"></A>0.1: Est-ce que c'&eacute;tait une bonne id&eacute;e
  d'embaucher un hacker?</DT>
  <DD>&Ccedil;a d&eacute;pend de la fonction. Un hacker sera incroyablement plus
  efficace qu'un autre employ&eacute; pour certaines fonctions, et incroyablement moins
  efficace pour d'autres. Les hackers sont particuli&egrave;rement comp&eacute;tents dans les t&acirc;ches suivantes:
  <ul>
  <li>Administrateur syst&egrave;me</LI>
  <li>Programmeur</LI>
  <li>Concepteur</LI>
  </ul>
  <p>Par contre les hackers ne produiront pas de bons r&eacute;sultats pour:
  </P>
  <ul>
  <li>Saisie de donn&eacute;es</LI>
  </ul>
  <p> De mani&egrave;re plus g&eacute;n&eacute;rale, une fonction demandant des changements
  rapides et soudains, des comp&eacute;tences avanc&eacute;es, et qui n'est pas tr&egrave;s
  r&eacute;p&eacute;titive, conviendra bien &agrave; un hacker. Les
  fonctions r&eacute;p&eacute;titives et/ou simples sont le g&acirc;chis d'un bon hacker, et
  vont l'ennuyer et le frustrer.</p>
  <p>Par contre, si vous donnez &agrave; votre hacker un travail qu'il aime
  particuli&egrave;rement, son efficacit&eacute; au travail sera de l'ordre de
  cinq &agrave; dix fois sup&eacute;rieure &agrave; celle d'un employ&eacute; &#34;normal&#34;.
  Ce n'est pas toujours le cas, et vous ne le verrez pas arriver &agrave;
  chaque fois, mais cela arrivera. C'est vraiment flagrant sur des t&acirc;ches
  particuli&egrave;rement ardues.</p>
</DD>
    <DT><A NAME="question-0.2"></A>0.2: Comment dois-je g&eacute;rer le travail de mon hacker?</DT>
  <DD>De la m&ecirc;me fa&ccedil;on que vous essayeriez de faire vivre des chats en
  troupeaux.
<p>
  &Ccedil;a peut &ecirc;tre un peu bizarre ; les hackers ne sont pas comme la plupart des autres
  employ&eacute;s. Mais ne vous inqui&eacute;tez pas! Votre hacker aura s&ucirc;rement envie
  de sugg&eacute;rer lui-m&ecirc;me les solutions aux probl&egrave;mes, si on le lui demande. La
  plupart des hackers peuvent g&eacute;rer leur travail tout seul.</P>
</DD>
    <DT><A NAME="question-0.3"></A>0.3: Euh, attendez, vous venez de dire
    &#34;dix fois&#34;, non? Vous n'&eacute;tiez pas s&eacute;rieux, quand m&ecirc;me?</DT>
  <DD>Oui, j'ai dit &#34;dix fois&#34;. Et, oui, je suis s&eacute;rieux ; un
  hacker, sur un projet, peut &ecirc;tre capable de produire, en un laps de
  temps de quelques mois, ce qu'un petit groupe de d&eacute;veloppeurs (par exemple, 7-8
  personnes) aurait du mal &agrave; accomplir en un an. Mais, cela peut tr&egrave;s bien ne
  pas se passer comme &ccedil;a. Tout cela peut varier...
  <p>IBM rapporte que certains de ses programmeurs &eacute;taient une centaine de
  fois plus productif que d'autres, voire plus. Ce genre de choses arrive, parfois.</p>
</DD>
    <DT><A NAME="question-0.4"></A>0.4: Je ne comprend rien a tout cela.
    Existe t-il un livre traitant de cela?</DT>
    <DD>Pas encore. Vous pouvez toujours vous reporter &agrave; <CITE>The New Hacker's
    Dictionary</CITE> (NDT: pas de version fran&ccedil;aise &agrave; ma connaissance)
    (le lien est plus bas ; il est connu aussi sous le nom de &#34;the jargon
    file&#34;), et en particulier &agrave; certains des annexes. Le tout est rempli
    d'explications et de d&eacute;tails sur la mani&egrave;re de penser des hackers.
    </DD>
    </DL>
		<H3><A NAME="partie-1"></A>Partie 1: Les probl&egrave;mes relationnels</H3>
		<DL>
		<DT><A NAME="question-1.0"></A>1.0: Mon hacker n'a pas
			l'air de s'adapter &agrave; l'ambiance de l'entreprise. Il
			a l'air de faire son travail correctement, mais ne se
			fait pas vraiment d'amis.</DT>
			<DD>C'est courant. Votre hacker peut tr&egrave;s bien ne pas
			avoir trouv&eacute; de personnes qui s'entendent bien avec
			les hackers. Vous pouvez songer au t&eacute;l&eacute;travail, ou
			bien &agrave; des horaires plus souples (lire: travail de
			nuit), ce qui peut certainement am&eacute;liorer sa
			productivit&eacute;. Ou bien embaucher un
			deuxi&egrave;me hacker.
			</DD>
			<DT><A NAME="question-1.1"></A>1.1: Mon hacker s'habille 
			bizarrement. Y a-t-il une fa&ccedil;on de lui faire
			comprendre l'importance de s'habiller correctement dans
			une entreprise?</DT>
			<DD>Votre hacker comprend tr&egrave;s bien l'importance de
			s'habiller correctement dans une entreprise: &ccedil;a n'aide
			en rien pour la r&eacute;alisation du travail. IBM, Ford, et
			Microsoft ont tous compris que les gens travaillent
			mieux quand ils ont la libert&eacute; de s'habiller comme bon 
			leur semble. Votre hacker s'habille de fa&ccedil;on &agrave; se
			sentir &agrave; l'aise dans ses v&ecirc;tements. Une demande
			polie pour mettre quelque chose de plus
			&#34;habill&eacute;&#34; lors d'&eacute;v&egrave;nements
			exceptionnels devrait sans doute &ecirc;tre re&ccedil;ue
			favorablement, et cela ne posera pas de probl&egrave;me &agrave;
			la plupart des hackers de mettre au placard les
			v&ecirc;tements d&eacute;chir&eacute;s, si on le leur demande. 
</DD>
			<DT><A NAME="question-1.2"></A>1.2: Mon hacker ne
			m'appelle pas par mon titre, et n'a pas l'air de me
			respecter du tout.</DT>
			<DD>Votre hacker ne respecte pas votre titre. Les
			hackers ne pensent pas que la gestion du personnel soit
			&#34;au-dessus&#34; du reste ; ils pensent que chacun
			fait son travail. Ils pourront m&ecirc;me parfois
			sous-entendre que la gestion du personnel est en-dessous 
			d'eux, mais apr&egrave;s tout c'est normal: votre question
			implique que vous consid&eacute;rez que son travail est
			en-dessous du v&ocirc;tre. Traitez votre hacker d'&eacute;gal &agrave;
			&eacute;gal, et vous verrez qu'il fera de m&ecirc;me -- une sorte
			de compliment!
</DD>
			<DT><A NAME="question-1.3"></A>1.3: Mon hacker insulte
			constamment le travail de mes autres employ&eacute;s.</DT>
			<DD>
			Prenez votre hacker &agrave; part, et demandez-lui des
			d&eacute;tails sur les probl&egrave;mes relatifs au travail des
			autres. Peut-&ecirc;tre y a-t-il quelque chose qui ne tourne 
			pas rond de ce c&ocirc;t&eacute;-l&agrave;. Ne vous laissez pas
			m&eacute;prendre par le fait que le syst&egrave;me puisse tourner
			la plupart du temps. Votre hacker est peut-&ecirc;tre
			g&ecirc;n&eacute; par le simple fait que &ccedil;a plante de temps en
			temps. Il peut ainsi sugg&eacute;rer certaines
			am&eacute;liorations qui pourront accro&icirc;tre les
			performances ou la fiabilit&eacute; de fa&ccedil;on extr&ecirc;mement
			significative. &Ccedil;a vaut le coup d'y pr&ecirc;ter attention.
			<p>Vous pourrez peut-&ecirc;tre convaincre votre hacker
			d'&ecirc;tre un peu plus poli, mais s'il y a des
			diff&eacute;rents tr&egrave;s importants, il est bien possible
			qu'un ou plusieurs de vos employ&eacute;s soient
			incomp&eacute;tents. Bien s&ucirc;r, les hackers ont une 
			conception du standard de comp&eacute;tence tout-&agrave;-fait diff&eacute;rente 
			de celle de beaucoup d'autres personnes.
			(lire: &#34;beaucoup plus grande&#34;)
			</P>
</DD>
		</DL>
		<H3><A NAME="partie-2"></A>Partie 2: Productivit&eacute;.</H3>
		<DL><DT><A NAME="question-2.0"></A>2.0: Mon hacker joue &agrave;
			des jeux vid&eacute;o pendant les horaires de travail.</DT>
			<DD>Les hackers, les &eacute;crivains, et les peintres ont
			tous besoin de passer du temps &agrave;
			&#34;d&eacute;compresser&#34; -- en faisant quelque chose
			d'autre, qui laisse leur subconscient travailler
			&agrave; la question. Votre hacker est probablement aux
			prises avec un probl&egrave;me difficile. Ne vous
			inqui&eacute;tez pas.
</DD>
			<DT><A NAME="question-2.1"></A>2.1: Mais &ccedil;a fait deux
			semaines que je n'ai vu aucun r&eacute;sultat!</DT>
			<DD>Votre hacker travaille, probablement tout seul, sur
			un projet d'envergure, et vient &agrave; peine de commencer,
			n'est-ce pas? Il est probablement en train d'essayer
			d'avoir une vue globale de la question, avant de
			commencer. Demandez-lui o&ugrave; il en est ; s'il vous
			r&eacute;pond par un jet continu de phrases qui
			s'interrompent avec &#34;non, attendez...&#34;, ou
			&#34;attendez, &ccedil;a ne pourra pas fonctionner comme cela...&#34;,
			c'est que &ccedil;a se passe bien.
</DD>
			<DT><A NAME="question-2.2"></A>2.2: Cela n'entame pas la 
			productivit&eacute;?</DT>
			<DD>Non. Votre hacker a besoin d'aborder l'abstraction 
			du probl&egrave;me sous diff&eacute;rents angles.
			Il sera plus productif une fois ce processus termin&eacute;.
			Votre hacker aime bien son travail ; ne vous inqui&eacute;tez 
			pas tant que les choses sont faites de fa&ccedil;on correcte et rapide.
</DD>
			<DT><A NAME="question-2.3"></A>2.3: Mon hacker fait
			constamment des choses sans aucun rapport avec sa
			fonction.</DT>
			<DD>N&eacute;cessitent-elles d'&ecirc;tre faites? Tr&egrave;s peu de
			hackers peuvent r&eacute;sister &agrave; l'envie de r&eacute;soudre un
			probl&egrave;me lorsqu'ils le peuvent, et lorsque personne
			d'autre ne le fait.
			<p>De plus, votre hacker finit-il son
			travail? Si c'est oui, consid&eacute;rez le reste comme un
			avantage (pour vous). Bien que ce ne soit pas
			traditionnel, cela est tr&egrave;s certainement b&eacute;n&eacute;fique.
			</P>
</DD>
			<DT><A NAME="question-2.4"></A>2.4: Mon hacker &eacute;crit
			un livre, lit les news USENET, joue &agrave; des jeux
			vid&eacute;o, discute avec ses amis au t&eacute;l&eacute;phone, et
			fait des cocottes en papier. Pendant les heures de travail!</DT>
			<DD>Il a l'air heureux. Il y a de fortes chances qu'il s'agisse
			de l'un de ces trois cas de figure:
			
			<OL>
				<LI>La charge de travail est variable (support
				technique par t&eacute;l&eacute;phone, documentation, etc) 
				et on est dans un creux de l'activit&eacute;. Ne vous 
				inqui&eacute;tez pas! </LI>
				<LI>Votre hacker est confront&eacute; &agrave; un
				probl&egrave;me difficile.</LI>
				<LI>Votre hacker s'ennuie et cherche quelque
				chose &agrave; faire. Peut-&ecirc;tre devriez-vous lui
				proposer un travail un peu plus prenant? </LI>
			</OL>
			<P>Plusieurs de ces facteurs peuvent &ecirc;tre en cause.
			Tous peuvent &ecirc;tre en cause. En g&eacute;n&eacute;ral, si le
			travail est prenant, et se voit r&eacute;alis&eacute;, ne vous
			inqui&eacute;tez pas trop de la mani&egrave;re de faire. Vous
			pouvez toujours demander &agrave; ce que le nom de
			l'entreprise soit cit&eacute; dans le livre.</p>
</DD>
			<DT><A NAME="question-2.5"></A>2.5: Mais, mes autres
			employ&eacute;s sont offens&eacute;s par le succ&egrave;s de mon
			hacker, et cela nuit &agrave; leur productivit&eacute;.</DT>

			<DD>Pr&eacute;f&eacute;rez-vous vraiment avoir des employ&eacute;s qui
			pourraient peut-&ecirc;tre &ecirc;tre les personnes qui vont
			r&eacute;soudre le probl&egrave;me, plut&ocirc;t que voir celui-ci d&eacute;j&agrave;
			r&eacute;solu? L'ego n'a pas sa place dans l'entreprise.
			S'ils ne peuvent pas faire le travail, donnez-leur une
			autre fonction, qu'ils peuvent remplir.
 </DD>
		</DL>
		<H3><A NAME="partie-3"></A>Partie 3: Stimulus et r&eacute;ponse</H3>
		<DL>			<DT><A NAME="question-3.0"></A>3.0: Mon hacker a fait
			quelque chose de tr&egrave;s bien, et je veux le r&eacute;compenser.</DT>
			<DD>Bien! Voici une liste de ce que la plupart des
			hackers aimeront recevoir en r&eacute;compense de leur
			travail:
			<OL>
				<LI>Le respect. </LI>
				<LI>L'admiration. </LI>
				<LI>Des compliments. </LI>
				<LI>De la compr&eacute;hension.</LI>
				<LI>Des r&eacute;ductions sur des jouets hors de prix. </LI>
				<LI>De l'argent. </LI>
			</OL>
			<P>Cette liste n'est pas forc&eacute;ment class&eacute;e dans le
			bon ordre. Le point num&eacute;ro quatre (la
			compr&eacute;hension) est le plus difficile. Essayez de vous
			rappeller de cette satisfaction la prochaine fois que
			vous d&eacute;couvrirez qu'il a pass&eacute; une journ&eacute;e
			enti&egrave;re &agrave; jouer &agrave; x-trek. Plut&ocirc;t que de vous
			plaindre au sujet du travail en cours, consid&eacute;rez que
			&ccedil;a compense la bonne performace pr&eacute;c&eacute;dente ; les
			hackers s'ennuient tr&egrave;s vite lorsqu'ils ne font plus
			leur travail.</p>
</DD>
			<DT><A NAME="question-3.1"></A>3.1: Mon hacker a produit 
			de mauvais r&eacute;sultats, et je veux le punir.</DT>
			
			<DD>Ne le faites pas. 30 ans de recherches en psychologie ont montr&eacute; que la
			punition n'a pas d'effet positif &agrave; long terme. Votre hacker n'est pas une
			souris de laboratoire. (Et m&ecirc;me s'il en <em>&eacute;tait</em> une, la punition ne
			fonctionnerait pas ; du moins, s'il s'agit des
			m&ecirc;me souris que celles sur lesquelles
       			les recherches en psychologie ont &eacute;t&eacute; men&eacute;es.) Si vous n'aimez pas ce
       			que votre hacker est en train de faire, exprimer vos critiques. Expliquez ce
       			qui vous d&eacute;range dans son comportement.
       			<p>Soyez pr&ecirc;t &agrave; devoir avancer des arguments ; votre hacker est une
       			entit&eacute; rationnelle, et a certainement ses raisons. Ne le jugez pas trop vite 
       			; ses raisons peuvent s'av&eacute;rer tout-&agrave;-fait valables.</p>
       			<p>N'ayez pas peur de vous excuser si vous aviez tort. Si votre hacker admet
       			avoir eu tort, ne demandez pas d'excuses ; pour un hacker, le fait
       			d'admettre avoir eu tort <em>est</em> s'excuser.</p>
</DD>
			<DT><A NAME="question-3.2"></A>3.2: Je ne comprend pas.
			J'ai propos&eacute; &agrave; mon hacker une augmentation
			substancielle, et il s'est senti offens&eacute;.</DT>
			<DD>Une promotion veut souvent dire aussi passer plus de 
			temps &agrave; &eacute;couter les gens d&eacute;crire ce qu'ils font,
			et passer moins de temps &agrave; jouer avec les ordinateurs.
			Votre hacker aime son travail ; si vous voulez lui offrir
			une r&eacute;compense, tournez-vous plut&ocirc;t vers un
			changement de titre, une augmentation de salaire, ou des
			compliments. Assurez-vous que votre hacker se rend
			compte que vous appr&eacute;ciez ce qu'il <em>a fait</em> --
			c'est pour faire ce travail qu'il est l&agrave;.
</DD>
			<DT><A NAME="question-3.3"></A>3.3: Les conventions de mon
			entreprise rendent impossible d'augmenter mon hacker s'il
			ne passe pas &agrave; un poste de gestion d'&eacute;quipe.</DT>
			<DD>Ce sont les conventions de votre entreprise qui sont
			fautives. Un hacker peut gagner jusqu'&agrave; 150$ de
			l'heure, voire plus, en faisant du conseil &agrave; son
			compte. Vous pouvez proposer &agrave; votre hacker une
			fonction de conseil au sein de votre entreprise, ou bien 
			trouver d'autres &eacute;chappatoires. Ou, trouver des choses 
			&agrave; offrir &agrave; votre hacker: beaucoup de hackers
			accepteront avec grand plaisir une r&eacute;duction sur du
			mat&eacute;riel provenant de leur constructeur favori.
</DD>
			<DT><A NAME="question-3.4"></A>3.4: Je ne pense pas que
			le hacker que nous employons m&eacute;rite vraiment le
			salaire qu'il touche.</DT>
			<DD>Demandez aux autres employ&eacute;s du m&ecirc;me service ce
			que le hacker fait concr&egrave;tement, et ce qu'il pensent
			de lui. Probablement que votre hacker passe une partie
			de son temps &agrave; r&eacute;pondre &agrave; des questions
			myst&eacute;rieuses, qui demanderaient normalement un conseil
			ext&eacute;rieur &agrave; l'entreprise, ce qui reviendrait tr&egrave;s
			cher. Votre hacker remplit peut-&ecirc;tre une autre
			fonction avec d'importantes responsabilit&eacute;s en-dehors
			de ses heures de travail. Tr&egrave;s peu de hackers ne
			m&eacute;ritent pas le salaire qu'ils gagnent; ils aiment
			r&eacute;soudre des probl&egrave;mes difficiles, et
			am&eacute;liorer de fa&ccedil;on g&eacute;n&eacute;rale le travail qui est
			fait.</DD>
		</DL>
		<H3><A NAME="partie-4"></A>Partie 4: Qu'est-ce que <cite>&ccedil;a</cite> veut
		dire?</H3>
		<DL>			<DT><A NAME="question-4.0"></A>4.0: Mon hacker ne parle
			pas fran&ccedil;ais. En tous cas, je ne <EM>pense</EM> pas.</DT>
			<DD>Votre hacker est &agrave; la pointe de la technique. Vous pouvez 
			toujours r&eacute;cup&eacute;rer le dictionnaire du jargon
			(<CITE>The New Hacker's Dictionary</CITE>).
			Vous pouvez le trouver ici:
			<A HREF="http://www.ccil.org/jargon">http://www.ccil.org/jargon</A>.
			Si vous n'arrivez pas &agrave; comprendre ce dictionnaire,
			demandez &agrave; votre hacker s'il veut bien vous expliquer
			quelques termes. Pour la plupart des hackers cela ne
			pose pas de probl&egrave;me. Soyez pr&ecirc;t pour l'explication, et ce n'est pas une
			insulte: si vous ne connaissez pas le mot, il
			<em>devra vous l'enseigner</em>.
			<p>Ce sont des mots assez compliqu&eacute;s; il y en a
			beaucoup, et leur utilisation est beaucoup plus
			pr&eacute;cise qu'il n'y parait au premier abord. Et les
			hackers adorent les jeux de mots.</p>
</DD>
			<DT><A NAME="question-4.1"></A>4.1: Je n'arrive pas &agrave;
			obtenir de mon hacker qu'il estime le temps n&eacute;cessaire 
			&agrave; la r&eacute;alisation du projet.</DT>
			<DD>Votre hacker n'a pas encore fini de d&eacute;terminer la
			difficult&eacute; du probl&egrave;me. A la diff&eacute;rence de
			beaucoup d'employ&eacute;s, les hackers essaieront de toutes
			leurs forces de refuser de donner une estimation tant
			qu'ils ne per&ccedil;oivent pas de fa&ccedil;on claire et nette le 
			probl&egrave;me qu'ils ont &agrave; r&eacute;soudre. Des fois, cela
			peut m&ecirc;me inclure le temps n&eacute;cessaire pour le
			r&eacute;soudre.
			<p>Aucun bon ing&eacute;nieur ne peut aller au-del&agrave; de 95%
			de certitude. La plupart des hackers sont de bons
			ing&eacute;nieurs. Si vous sp&eacute;cifiez bien que vous
			n'utiliserez pas l'estimation pour interrompre le projet 
			s'il n'est pas termin&eacute; &agrave; la date
			pr&eacute;vue (et si vous comptez
			honorer cette promesse!) vous pourrez certainement
			obtenir une estimation. Cette estimation pourra
			peut-&ecirc;tre para&icirc;tre tr&egrave;s &eacute;lev&eacute;e, ou bien tr&egrave;s
			faible. De toutes fa&ccedil;ons, ce n'est qu'une estimation,
			et c'est ce que vous aviez demand&eacute;.</p>
</DD>
			<DT><A NAME="question-4.2"></A>4.2: Mon hacker fait des
			jeux de mots bizarres, ou sans grande signification.</DT>
			<DD>Si vous &ecirc;tes courageux, demandez une explication.
			La plupart des jeux de mots peuvent &ecirc;tre expliqu&eacute;s.
			L'explication pourra prendre un peu de temps, mais cela
			peut vouloir dire qu'elle est int&eacute;ressante.
			</DD>
			<DT><A NAME="question-4.3"></A>4.3: Mon hacker compte
			&agrave; partir de z&eacute;ro.</DT>
			<DD>Comme le fait un ordinateur. Vous pouvez faire
			semblant de ne pas y pr&ecirc;ter attention, mais les ordinateurs
			comptent &agrave; partir de z&eacute;ro. En fait, la plupart des
			hackers le font par habitude.
			</DD>
		</DL>
		<HR>
		<P>Des commentaires sur cette page peuvent &ecirc;tre envoy&eacute;s (en
		anglais) &agrave;: </P>
		<ADDRESS><A HREF="mailto:seebs@plethora.net">seebs@plethora.net</A></ADDRESS>
	</BODY>

</HTML>
