<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
        "http://www.w3.org/TR/REC-html40/loose.dtd">
<html>
<head>
</head>

<body BGCOLOR=#FFFFFF TEXT=#000000 LINK=#000088 ALINK=#0000A8 VLINK=#7777DD>
		<TABLE WIDTH=100% BORDER=0 CELLSPACING=0>
 <TR>
  <TD>Paquets Ip Anormaux<SPAN CLASS=btitle><BR>
					</SPAN>
  <SPAN CLASS=author>par <a href="mailto:kfred@execpc.com">Karen Frederick</a></SPAN><BR>
					Derniere modification le Vendredi 13 Octobre 2000

					<p>Traduction: <a href="mailto:skoop@users.sourceforge.net">skoop@users.sourceforge.net</a><br>
						Derniere modification: 21/04/2001</p>
					<hr>
				</TD>
				<TD WIDTH=10 ROWSPAN=2><IMG SRC="/images/pixel.gif" WIDTH=10>
			</TR>
 <TR>
  <TD valign=top><span class=text><SPAN CLASS=btitle>Introduction</SPAN></span>
					<P>Cet article fera part de certaines caract&eacute;ristiques de paquets (IP) anormaux/malveillants, c'est le premier d'une s&eacute;rie de tutorielles qui auront pour but d'en apprendre plus aux administrateurs sur la d&eacute;tection d'intrusion au niveau IP. Comme l'utilisation de syst&egrave;mes de d&eacute;tection d'intrusion devient plus r&eacute;pandue, les administrateurs syst&egrave;me se doivent d' apprendre comment les employ&eacute;s efficacement. Malheureusement, beaucoup d'administrateurs n'ont pas de connaissances approfondies concernant l'IP. Ainsi, bien qu'un IDS puisse produire des alertes concernant des scans particuliers et/ou des attaques, il est possible qu'un admin ne sache pas comprendre la signification de ces alertes.</P>
					<p>Le protocole IP est d&eacute;finit dans les documents RFC (Request for Comments) se situant &agrave; <a target="nonlocal" href="http://www.ietf.org/rfc.html ">http://www.ietf.org/rfc.html</a><a target="non-local" href="http://www.ietf.org/rfc.html "><a></a></a></p>
					<P>Pour cet article, nous d&eacute;finissons les paquets anormaux comme &eacute;tant ceux qui violent ces standards. Les paquets anormaux peuvent &ecirc;tre produits a cause de probl&egrave;mes b&eacute;nins comme par exemple des routeurs mal fonctionnant mais proviennent g&eacute;n&eacute;ralement d'attaques. L'anomalie est souvent int&eacute;gr&eacute;e dans le paquet expr&egrave;s afin que le paquet puisse &eacute;viter d' &ecirc;tre bloqu&eacute; par un firewall (coupe-feu) ou le syst&egrave;me de d&eacute;tection d'intrusion. Dans d'autres cas, des paquets anormaux sont employ&eacute;s pour essayer crasher des syst&egrave;mes. Une grande place pour voir des exemples r&eacute;els de paquets incorrects est l'Institut SANS <A HREF="http://www.sans.org/giac.htm" TARGET="nonlocal">Global Incident Analysis Center</A>.</P>
					<span class=text><SPAN CLASS=btitle>Protocol IP: Types</SPAN></span>
					<P>Il existe beaucoup de protocoles IP diff&eacute;rents. vous &ecirc;tes probablement familier avec au moins trois d'entre eux: le Transmission Control Protocol (TCP), le User Datagram Protocol (UDP) et l' Internet Control Message Protocol (ICMP). Il existe des milliers d'autres protocole IP&nbsp;; des exemples que vous connaissez s&ucirc;rement incluent les protocoles de routage comme l' IGRP, EIGRP et l' OSPF. Chaque type de protocole ip a sa propre valeur, appel&eacute; Internet Protocol Number. Ils sont importants &agrave; conna&icirc;tre car certains syst&egrave;mes loguent leurs paquets par num&eacute;ros et non pas par l'abr&eacute;viation correspondante. Dans cet article, nous reverrons quelques caract&eacute;ristiques des types de protocoles les plus utilis&eacute;s, qui ont pour type 1 (ICMP), type 6 (TCP) et type 17 (UDP). Une liste de tous ces num&eacute;ros IP est disponible &agrave;<span class=text> <a href="ftp://ftp.isi.edu/in-notes/iana/assignments/proto!
col-numbers" target="non-local">ftp://ftp.isi.edu/in-notes/iana/assignments/protocol-numbers</a></span></P>
					<P>Le RFC 791 d&eacute;crit un champ de 4 Bit utilis&eacute; pour identifier la base du protocole dans les paquets IP. Le Protocole Internet avec lequel nous sommes familiers a pour version 4. La nouvelle version d'IP, qui sera d&eacute;ploy&eacute; dans les ann&eacute;es &agrave; venir, est la num&eacute;ro 6. Normalement, vous ne risquez pas de voir un paquet avec une version autre que 4, mais il se peut que la version 6 soit rencontr&eacute; (rarement). Si vous voyez un paquet ayant une version autre que 4 ou 6, vous pouvez &ecirc;tre sur qu'il est corrompu. Pour plus d'informations, visiter<span class=text> <A HREF="http://www.isi.edu/in-notes/iana/assignments/version-numbers"
TARGET="nonlocal">http://www.isi.edu/in-notes/iana/assignments/version-numbers</A>.</span></P>
					<span class=text><SPAN CLASS=btitle>Adresses IP</SPAN></span>
					<P>Certaines adresses Ip d&eacute;sign&eacute;es par l' IANA (Internet Assigned Numbers Authority) sont r&eacute;serv&eacute;es pour les r&eacute;seaux locaux uniquement et non pas pour une utilisation sur le r&eacute;seau d' Internet. Les gammes d'adresse r&eacute;serv&eacute;es sont&nbsp;: 10.0.0.0 - 10.255.255.255, 172.16.0.0 - 172.31.255.255 et 192.168.0.0 - 192.168.255.255. (Lire le RFC 1918, &quot;Address Allocation for Private Internets&quot;, a<span class=text><span class=text> <A
HREF="http://www.isi.edu/in-notes/rfc1918.txt" TARGET="nonlocal">http://www.isi.edu/in-notes/rfc1918.txt</A> pour plus d'informations.) On ne devrait jamais voir ces adresses sur Internet et si on les rencontre c'est parfois due a une erreur mat&eacute;riel (mal configur&eacute;) ;par exemple, un firewall peut accidentellement autoriser des adresses locales a acc&eacute;der a Internet. Ainsi que des machines qui tentent sans succ&eacute;es de s'attribu&eacute;es une adresse Internet valide en passant par un serveur DHCP, se voient attribu&eacute; des adresses du sous-reseaux 169.254.x.x Une autre raison de rencontrer ces adresses sur Internet peuvent venir du fait que les paquets ont &eacute;t&eacute; modifi&eacute; a la source par un attaquant. cette technique est plus connu sous le nom de Spoofing. </span></P>
					<P>La raison principal pour utiliser le Spoofing IP est de rendre plus dure la recherche de l'ip r&eacute;elle d'un attaquant. Les attaquants peuvent employer des adresses dans les gammes d' adresses r&eacute;serv&eacute;es inscrites ci-dessus ; plus g&eacute;n&eacute;ralement, ils emploient les adresses r&eacute;guli&egrave;res qui appartiennent &agrave; quelqu'un d'autre. Ainsi si votre syst&egrave;me est attaqu&eacute;, vous pouvez retrouver l' IP d' un tiers innocent. Un autre type d'attaque de spoofing IP, appel&eacute;e Land attack, emploie des paquets ayant pour source et destination la m&ecirc;me valeur. Les paquets doivent toujours avoir une adresse source diff&eacute;rente de l'adresse de destination si ceux-l&agrave; proviennent d'Internet, donc votre mat&eacute;riel r&eacute;seau (cartes ethernet ...) doit rejeter un paquet o&ugrave; ces valeurs sont les m&ecirc;mes.</P>
					<P><span class=text>-(Mix du paragraphe original dans celui du dessus).-</span></P>
					<span class=text><SPAN CLASS=btitle>Paquets TCP</SPAN></span>
					<P>TCP est un protocole orient&eacute; connexion il emploie des drapeaux (flags) divers pour indiquer qu'une connexion est commenc&eacute; ou fini, ou que les donn&eacute;es sont prioritaires ou non. Beaucoup d'attaques sont bas&eacute;es sur la modification de ces drapeaux TCP. Les certaines combinaisons ill&eacute;gales de drapeaux TCP peuvent &ecirc;tre capables d'aider des paquets &agrave; &eacute;viter d' &ecirc;tre d&eacute;tecter par des firewalls et/ou des syst&egrave;mes de d&eacute;tection d'intrusion ; d'autres combinaisons ill&eacute;gales peuvent &ecirc;tre employ&eacute;es pour faire planter le syst&egrave;me d'exploitation.</P>
					<P>Les Sp&eacute;cifications du Protocole TCP sont d&eacute;finies dans le<span class=text> <A HREF="http://www.ietf.org/rfc/rfc0793.txt?number=793"
TARGET="nonlocal">RFC 793</A>. Ce RFC ainsi que d'autres d&eacute;finit comment les syst&egrave;mes doivent r&eacute;pondre aux paquets l&eacute;gitimes, mais ils n'expliquent pas comment les syst&egrave;mes doivent manipuler les combinaisons ill&eacute;gales de drapeaux. Par cons&eacute;quent, des syst&egrave;mes d'exploitation r&eacute;pondent diff&eacute;remment aux combinaisons de drapeau ill&eacute;gales. Les attaquants peuvent exploiter cela pour d&eacute;terminer quel un dispositif est employ&eacute; sur tel ou tel syst&egrave;me d'exploitation. </span></P>
					<P>Au moins un de ces six drapeaux doit &ecirc;tre dans chaque paquet TCP&nbsp;; chaque drapeau correspond &agrave; un bit particulier placer dans l'en-t&ecirc;te TCP. Les six drapeaux sont : </P>
					<UL>
						<LI><span class=text>SYN (Synchronization) - Introduit une connexion TCP.</span></LI>
						<LI><span class=text>ACK (Acknowledgment) - Indique que la valeur dans le champ &quot;acknowledgment number&quot; est valide.</span></LI>
						<LI><span class=text>FIN (Finish) - Finit gracieusement une connexion TCP.</span></LI>
						<LI><span class=text>RST (Reset) - Termine imm&eacute;diatement une connexion TCP.</span></LI>
						<LI><span class=text>PSH (Push) - Dis au r&eacute;cepteur d'envoyer les donn&eacute;es aussi rapidement que possibles.</span></LI>
						<LI><span class=text>URG (Urgent) - Indique que le pointeur &quot;Urgent&quot; est valide&nbsp;; souvent caus&eacute; par une interruption.</span></LI>
					</UL>
					<P>Avant l'examen des combinaisons de drapeau incorrectes, regardons les normaux&nbsp;:</P>
					<UL>
						<LI><span class=text>SYN, SYN ACK, et ACK sont utilis&eacute; dans le processus en 3 temps qui permet d'&eacute;tablir une connexion TCP.</span></li>
						<LI>Exception pour le paquet initial SYN, chaque paquet dans la connexion doit avoir le bit ACK.</LI>
						<LI><span class=text>FIN ACK et ACK sont employ&eacute;s pendant le teardown gracieux d'une connexion existante.</span></LI>
						<li>RST ACK peuvent &ecirc;tre utilis&eacute;es pour terminer une connexion existante.
						<li>Des paquets pendant la partie de &quot;conversation&quot; de la connexion (apr&egrave;s le processus a 3 temps mais avant le teardown ou la terminaison) contiennent juste un ACK par d&eacute;faut. Facultativement, ils peuvent aussi contenir PSH et/ou URG.</LI></UL>
						<li>Les paquets ayant une autre combinaison de drapeau peuvent &ecirc;tre class&eacute;s comme anormaux. Voici ceux qui arrivent le plus souvent&nbsp;:
					
					<UL>
						<LI>SYN FIN est probablement la combinaison &quot;ill&eacute;gale&quot; la plus connut. Rappelez-vous que le drapeau SYN est utilis&eacute; pour d&eacute;buter une connexion et FIN pour la fermer. Il est absurde d'ex&eacute;cuter ces deux actions en m&ecirc;me temps. Beaucoup de scanners de ports utilise ce type de paquet car beaucoup d'outil de d&eacute;tection d'intrusion ne pouvait d&eacute;tecter ce type de scan auparavant. Si vous rencontrez ce type de paquet, vous pouvez &ecirc;tre sur qu'il est malveillant.</LI>
						<LI><span class=text>SYN FIN PSH, SYN FIN RST, SYN FIN RST PSH, et d'autres variantes de SYN FIN existent aussi. Ces paquets peuvent &ecirc;tre employ&eacute;s par les attaquants qui sont conscients que les syst&egrave;mes de d&eacute;tection d'intrusion peuvent chercher des paquets avec juste le Bit SYN et le bit FIN, sans autres bits suppl&eacute;mentaires. De nouveau, ceux-ci sont clairement malveillants.</span></LI>
						<LI>Des paquets ne devraient jamais contenir uniquement un drapeau FIN. Ceux-l&agrave; sont souvent utilis&eacute;s par des scanners de ports, des d&eacute;tecteurs de configuration r&eacute;seau ou d&#146;autres activit&eacute;s rus&eacute;es.</LI>
						<LI>Quelques paquets n'ont absolument aucun drapeau du tout&nbsp;; ceux-ci sont mentionn&eacute;s comme des paquets &quot;null&quot;. Il est ill&eacute;gal d'avoir un paquet &quot;null&quot; qui transite sur le r&eacute;seau.</LI>
					</UL>
					<P>En plus des six drapeaux pr&eacute;sent&eacute;s ici, les paquets TCP ont deux bits suppl&eacute;mentaires qui sont r&eacute;serv&eacute;s pour une utilisation future. Ils sont connuent sous le nom de &quot;reserved bits&quot;. Si un paquet a un de ces bits dans son en-t&ecirc;te alors celui-ci est probablement malveillant.</P>
					<P>D'autres caract&eacute;ristiques de paquets anormaux peuvent &ecirc;tre not&eacute;s&nbsp;:</P>
					<UL>
						<LI>Les paquets ne doivent jamais avoir pour adresse source ou destination 0.</LI>
						<LI>Le num&eacute;ro de reconnaissance (ACK) ne doit pas &ecirc;tre de 0 lorsque celui-ci est activ&eacute;.</LI>
						<LI>Un paquet contenant uniquement le drapeau SYN, qui est envoy&eacute; lors d'une nouvelle connexion, ne doit jamais contenir de donn&eacute;es.</LI>
						<LI>Les paquets ne doivent pas avoir pour adresse de destination une adresse Broadcast, se terminant g&eacute;nerallement par .0 ou .255. (Vous n'&ecirc;tes probablement pas familier avec les adresses Broadcast se terminant par .0, celles-las sont assez anciennes). Les Broadcast ne sont pas normalement ex&eacute;cut&eacute;es en utilisant TCP.</LI>
					</UL>
					<P>Beaucoup des outils employ&eacute;s par les attaquants pour parcourir et explorer vos r&eacute;seaux sont bas&eacute;s sur l'utilisation de paquets TCP incorrects. Un grand pourcentage d'alertes d&eacute;tect&eacute;es par des syst&egrave;mes de d&eacute;tection d'intrusion implique ces types de paquets, donc il est imp&eacute;ratif d'&ecirc;tre capable de les identifier et de comprendre leur but. En configurant votre syst&egrave;me de d&eacute;tection d'intrusion pour &ecirc;tre alert&eacute; sur tous les paquets incorrects TCP, vous pouvez analyser l'activit&eacute; malveillante que vous ne voyiez probablement pas pr&eacute;c&eacute;demment.</P>
					<span class=text><SPAN CLASS=btitle>Paquets UDP</SPAN></span>
					<P>&Agrave; la diff&eacute;rence de TCP, UDP est un protocole de sous connexions. UDP n'a pas de drapeaux ni de &quot;reserved bits&quot; contrairement au TCP. Cependant TCP et UDP sont utilis&eacute;s sur des ports de destination et de source. Comme TCP, les paquets UDP ne doivent jamais avoir un port source/destination &agrave; 0. Les paquets UDP peuvent aussi &ecirc;tre fragment&eacute;s avec malveillance&nbsp;; voir la section &quot;de Fragmentation&quot; ci-dessous pour plus d'information sur cette technique.</P>
					<span class=text><SPAN CLASS=btitle>Paquets ICMP</SPAN></span>
					<P>ICMP est employ&eacute; pour passer un message d'erreur entre deux h&ocirc;tes ou un h&ocirc;te et un dispositif r&eacute;seau (comme un routeur). Etant donn&eacute; que UDP et IP sont des protocoles de sous-connections (connectionless), ils comptent sur ICMP pour transmettre des messages d'erreur sur leur d&eacute;fense. Pour &eacute;viter des boucles de message d'erreur potentielles, les r&eacute;ponses ne sont jamais envoy&eacute;es aux messages d'erreur ICMP. ICMP n'a aucun num&eacute;ro de port&nbsp;; il emploie des types de message ICMP ainsi que des codes au lieu de cela. Une autre caract&eacute;ristique remarquable d'ICMP est qu'il supporte le trafic d'&eacute;mission. Etant donn&eacute; que les paquets ICMP ne sont pas tr&egrave;s compliqu&eacute;, il n'y a pas beaucoup de mani&egrave;res de les rendre anormaux.</P>
					<P>Un type de message ICMP qui est employ&eacute; avec malveillance est la redirection. Les messages &quot;ICMP redirect&quot; sont envoy&eacute;s d'un routeur vers une machine pour lui signaler que passer par un routeur diff&eacute;rent serait plus rapide pour atteindre une adresse ip particuli&egrave;re. Quelques attaques comme WinFreeze emploient des messages ICMP redirect faux pour essayer de convaincre un h&ocirc;te que la machine de l'attaquant est le routeur le plus appropri&eacute; pour n'importe quel adresse. Evidemment ce type de paquets doit &ecirc;tre absolument d&eacute;tecter.</P>
					<P>La plupart des paquets ICMP sont compos&eacute;s d'une petite en-t&ecirc;te et ainsi que d'un champ de donn&eacute;es (payload) ; par exemple, la plupart des paquets de demande d'&eacute;cho d'ICMP ont une en-t&ecirc;te de 8 octets et un champ de donn&eacute;es de 56 octets.Les paquets ICMP qui sont significativement plus grands que la normale doivent &ecirc;tre consid&eacute;r&eacute;s comme soup&ccedil;onneux. Aussi, quelques types de messages ICMP, comme des demandes d'&eacute;cho, ne doivent comporter aucune donn&eacute;e. Quelques applications malveillantes comme les diff&eacute;rents programmes de saturation r&eacute;seau (Denial of Service) ou de tunneling, utilise des paquets ICMP comme &eacute;tant ceux qui occuperont l'IDS ou autres pour cacher le reste du trafic qui pourrait &ecirc;tre encore plus dangereux. Donc une r&eacute;ponse d'&eacute;cho d'ICMP pourrait en r&eacute;alit&eacute; contenir un protocole IP compl&egrave;tement diff&eacute;rent dans ses do!
nn&eacute;es. Si vous contr&ocirc;lez vos syst&egrave;mes pour des grands paquets ICMP ou pour des paquets des types ICMP sp&eacute;cifiques qui ne doivent pas contenir des donn&eacute;es mais le font, vous devez &ecirc;tre capables de d&eacute;tecter ce type de trafic.</P>
					Fragmentation
					<P>Quand un paquet IP est trop grand pour &ecirc;tre transmis comme une entit&eacute;, il doit &ecirc;tre coup&eacute; en des pi&egrave;ces plus petites qui peuvent &ecirc;tre envoy&eacute;es au travers du r&eacute;seau. Chaque morceau d'un paquet est mentionn&eacute; comme un fragment. La fragmentation est utilis&eacute;e par tous les protocoles dont nous discutons - TCP, UDP et ICMP - bien qu'il arrive le plus fr&eacute;quemment pour TCP. Cependant, les attaquants peuvent cr&eacute;er des paquets artificiellement fragment&eacute;s. Dans quelques cas, c'est fait pour essayer de faire planter des syst&egrave;mes; dans d'autres cas, c'est utilis&eacute; pour &eacute;viter des r&egrave;gles de firewalls ou &eacute;viter des syst&egrave;mes de d&eacute;tection d'intrusion. Quelques firewalls ainsi que des syst&egrave;mes de d&eacute;tection d'intrusion ne rassemblent pas chaque paquet, donc ils peuvent seulement consid&eacute;rer les propri&eacute;t&eacute;s de chaque fragme!
nt individuel.</P>
					<p>Un type de fragmentation malveillante implique les fragments qui ont des offset ill&eacute;gaux. Une valeur d' offset indique o&ugrave; les donn&eacute;es d'un fragment doivent &ecirc;tre plac&eacute;es dans un paquet rassembl&eacute;. Le premier fragment semble &ecirc;tre normal, sauf qu'il est habituellement tr&egrave;s petit. Le deuxi&egrave;me fragment a un offset d' une valeur de donn&eacute;es qui est moins grande que la longueur des donn&eacute;es dans le premier paquet. Ainsi si le premier fragment avait 24 octets de donn&eacute;es, le deuxi&egrave;me fragment pourrait avoir un offset de 20 octets. Cela signifierait que les donn&eacute;es dans le deuxi&egrave;me fragment recopieraient les quatre derniers octets des donn&eacute;es du premier fragment. Si le paquet fragment&eacute; &eacute;tait TCP, alors le premier fragment contiendrait son en-t&ecirc;te TCP. Le but de la valeur de l'offset du deuxi&egrave;me fragment serait de recopier la partie de l' en-t&ecir!
c;te TCP du premier paquet, comme le num&eacute;ro de port de destination, quand le paquet sera rassembl&eacute; &agrave; la destination. Donc un attaquant pourrait envoyer un paquet fragment&eacute; passant votre coupe-feu et se dirigeant vers votre serveur Web sur le port 80, mais quand le serveur Web rassemblera les fragments, alors le paquet final pourrait en r&eacute;alit&eacute; aller &agrave; un port compl&egrave;tement diff&eacute;rent.</p>
					<P>Le m&ecirc;me type d'attaque peut &ecirc;tre employ&eacute; pour faire planter des syst&egrave;mes. Dans des syst&egrave;mes d'exploitation quelque peu plus vieux, quand l'h&ocirc;te a re&ccedil;u un paquet et tente de reconstruire un tel paquet, il calcule une longueur n&eacute;gative pour le deuxi&egrave;me fragment. On passe cette valeur &agrave; une fonction qui doit faire une copie de la m&eacute;moire. Malheureusement, la copie de cette m&ecirc;me m&eacute;moire ne peut pas manipuler un nombre n&eacute;gatif, donc il pense que le petit nombre n&eacute;gatif est en r&eacute;alit&eacute; un &eacute;norme nombre positif.</P>
					<p>Un second type d'attaque faisant appel aux fragments est connu sous le nom d'attaque par fragment minuscule. Deux fragments TCP sont cr&eacute;&eacute;s. Le premier est si petit qu'il n'inclut m&ecirc;me pas l'en-t&ecirc;te TCP compl&egrave;te, et particuli&egrave;rement le num&eacute;ro de port de destination. Le deuxi&egrave;me fragment contient le reste de l'en-t&ecirc;te TCP, incluant cette fois-ci le num&eacute;ro de port de destination. Certains firewalls et d&eacute;tecteur d'intrusion peuvent laisser passer un ou deux paquets et plus particuli&egrave;rement si ils ne rassemblent pas le paquet avant de le laisser passer.</p>
					<P>Un autre type d'attaque implique l'envoi d'un paquet fragment&eacute; anormalement grand. L'attaquant esp&egrave;re que quand l'h&ocirc;te de r&eacute;ception recevra les fragments du paquet, il plantera en essayant de rassembler le paquet, puisque le paquet entier a une longueur ill&eacute;gale. (Pour information, les paquets ont des longueurs minimales et maximales.) L'exemple le plus connut de ce type est l'attaque Ping of Death. Il cr&eacute;e un paquet de demande d'&eacute;cho d'ICMP qui est plus grand que la taille de paquet maximale de 65,535 octets.</P>
					<P>Quelques attaques emploient des paquets qui ne sont pas ill&eacute;gaux, mais qui ont de quoi &ecirc;tre extr&ecirc;mement soup&ccedil;onneux. Par exemple, supposez que vous receviez un paquet fragment&eacute; TCP qui contient uniquement le drapeau SYN. Puisque l'on ne permet pas &agrave; un paquet contenant seulement le drapeau SYN de porter n'importe quelles donn&eacute;es, alors la fragmentation n'est pas exig&eacute;e. Si vous rencontrez un tel paquet, traitez-le avec prudence.</P>
					<P>Ainsi comment pouvez-vous prot&eacute;ger votre r&eacute;seau contre des attaques de fragmentation ? Comme mentionn&eacute; pr&eacute;c&eacute;demment, vous devez mettre en place des firewalls ainsi que des syst&egrave;mes de d&eacute;tection d'intrusion qui peuvent rassembler les paquets fragment&eacute;s. Vous devez aussi configurer votre syst&egrave;me de d&eacute;tection d'intrusion afin d' &ecirc;tre alert&eacute; sur n'importe quels fragments &eacute;tant plus petit que le fragment final dans un paquet. En temps normal, vous ne devez pas voir des petits fragments initiaux&nbsp;; ceux-ci ont de grandes chances d' &ecirc;tre malveillants. Aussi, n'oubliez pas de vous tenir au courant des patchs/correctifs concernant votre syst&egrave;me ainsi que des mises-a-jour.</P>
					<span class=text><SPAN CLASS=btitle>Conclusion</SPAN></span>
					<P>Qui que ce soit &eacute;tant impliqu&eacute; dans la d&eacute;tection d'intrusion doit avoir une connaissance solide de ce que le trafic IP normal et incorrect est. Ce n'est pas rare pour un administrateur syst&egrave;me de d&eacute;tection d'intrusion d' obtenir de grandes alertes venant  l'IDS mais de ne sachant pas comprendre le vrai sens. On esp&egrave;re qu'en &eacute;tudiant plus le protocole IP et en pensant aux concepts pr&eacute;sent&eacute;s dans cet article, vous pourrez mieux interpr&eacute;ter ces alertes et analyser ce qui se passe r&eacute;ellement sur votre r&eacute;seau.</P>
					<P><span class=text><A HREF="mailto:kfred@execpc.com">Karen Frederick</A> est ing&eacute;nieur en s&eacute;curit&eacute; pour NFR Securit&eacute;. Karen &agrave; un B.S. dans l'Informatique et ach&egrave;ve sa th&egrave;se sur la d&eacute;tection d'intrusion a l'Universit&eacute; de l'Idaho. Elle &agrave; acquerit plusieurs certificats, incluant le &quot;Microsoft Certified Systems Engineer + Internet&quot;, le &quot;Check Point Certified Security Administrator,&quot; ainsi que le &quot;GIAC Certified Intrusion Analyst&quot;. Karen fait partie des auteurs et r&eacute;dacteurs de &quot;Intrusion Signatures and Analysis&quot;, un livre sur la d&eacute;tection d'intrusion qui sera publi&eacute;e en janvier 2001</span></P>
				</td>
</tr>
</table>
		<P>
<CENTER>
			<A CLASS=sslink HREF="/legalize/copyright.html">copyright</A></CENTER>
<CENTER><A CLASS=sslink HREF="/about/advertising.html">Interested in advertising
 with us?</A></CENTER>
</body _parsed>
</HTML>