
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <title>S&eacute;curit&eacute; des logiciels libres - Haute disponibilit&eacute;</title>

</head>
<body BGCOLOR="#FFFFFF">

<p>
<center>
<img src=logo-fd-eads.gif>
</center>
<p>
<center>
<table BORDER=1>
<tr>

<td>
<div align=right>Auteur :</div>

<td>
<div>Eric
B&eacute;renguier</div>
</tr>

<tr>

<td>
<div align=right>R&eacute;f&eacute;rence :</div>
</td>

<td>
<div>00-176/200000633</div>
</tr>

<tr>
<td>
<div align=right>Version :</div>
</td>

<td>
<div>1.0</div>

<tr>

<td>
<div align=right>Date :</div>

<td>
<div>30/06/2000</div>

<tr>
<td>
<div align=right>Approbateur :</div>

<td VALIGN=TOP WIDTH="147">
<div>Guy
Autier</div>

</table>
</center>

<p>
<center><table BORDER=0 CELLSPACING=0 CELLPADDING=0 >
<tr>
<td VALIGN=TOP WIDTH="556">
<center><h2>CELAR</h2></center>
<center><h2>S&eacute;curit&eacute; des logiciels libres</h2></center>
<center><h2>Haute disponibilit&eacute;</h2></center>
</td>
</tr>
</table></center>

<div></div>

<br>
<br>

<p>

<p>Historique des r&eacute;visions

<br>&nbsp;
<table BORDER=1 CELLSPACING=0 CELLPADDING=0 >
<tr>
<td VALIGN=TOP WIDTH="38">
<div>N&deg;</div>
</td>

<td VALIGN=TOP WIDTH="81">
<div>Date</div>
</td>

<td VALIGN=TOP WIDTH="89">
<div>Auteur</div>
</td>

<td VALIGN=TOP WIDTH="340">
<div>Contenu</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="38">
<div>0.1</div>
</td>

<td VALIGN=TOP WIDTH="81">
<div>23/05/2000</div>
</td>

<td VALIGN=TOP WIDTH="89">
<div>E.B.</div>
</td>

<td VALIGN=TOP WIDTH="340">
<div>Cr&eacute;ation</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="38">
<div>1.0</div>
</td>

<td VALIGN=TOP WIDTH="81">
<div>30/06/2000</div>
</td>

<td VALIGN=TOP WIDTH="89">
<div>E.B.</div>
</td>

<td VALIGN=TOP WIDTH="340">
<div>Mise &agrave; jour</div>
</td>
</tr>
</table>


<p>&nbsp;
<p>

<p>Table des mati&egrave;res

<p>

<p>1.Introduction

<p>2.Fonctions
sp&eacute;cifiques la haute disponibilit&eacute;

<p>2.1.Pr&eacute;sentation
g&eacute;n&eacute;rale

<p>2.2.Mise
en cluster

<p>2.3.Disponibilit&eacute;
des donn&eacute;es

<p>2.4.Redondance
mat&eacute;riellelocale

<p>2.5.Redondance
multi-sites

<p>2.6.Equilibrage
de charge

<p>2.7.Administration
et exploitation

<p>3.Produits

<p>3.1.Principaux
produits &eacute;tudi&eacute;s

<p>3.1.1.Linux

<p>3.1.2.HeartBeat

<p>3.1.3.Mon

<p>3.1.4.DRBD

<p>3.1.5.ReiserFS

<p>3.1.6.GFS

<p>3.1.7.LVS

<p>3.2.Couverture
fonctionnelle des produits

<p>3.3.Aspects
relatifs &agrave; la s&eacute;curit&eacute;

<p>4.Comparaison

<p>4.1.Crit&egrave;res

<p>4.1.1.Crit&egrave;res
fonctionnels

<p>4.1.2.Crit&egrave;res
g&eacute;n&eacute;raux

<p>4.1.3.Notation

<p>4.2.Tableaux
de comparaison

<p>4.3.Synth&egrave;se

<p>5.Le
futur

<p>
<br>
<br>
<h1>
1.&nbsp;Introduction</h1>

<div>Ce document pr&eacute;sente le r&eacute;sultat de
l'&eacute;tude sur les solutions de haute disponibilit&eacute; &agrave;
base de logiciels libres. Les points trait&eacute;s sont les suivants :</div>


<UL><LI>Etude
des produits existants ;</UL>

<UL><LI>Comparaison
avec deux des principales solutions commerciales ;</UL>

<UL><LI>Evaluation
des probl&egrave;mes de s&eacute;curit&eacute; pos&eacute;s par les produits
&eacute;tudi&eacute;s.</UL>

<p>

<p>Le document comprend les parties suivantes :

<UL><LI>Pr&eacute;sentation
des fonctions relatives &agrave; la haute disponibilit&eacute; ;</UL>

<UL><LI>Pr&eacute;sentation
des produits &eacute;tudi&eacute;s : fonctionnalit&eacute;s et caract&eacute;ristiques
techniques ;</UL>

<UL><LI>R&eacute;sultat
de l'&eacute;valuation : pr&eacute;sentation des crit&egrave;res, et &eacute;valuation
selon ces crit&egrave;res (pour les produit &eacute;tudi&eacute;s et les
deux solutions commerciales retenues) ;</UL>

<UL><LI>Pr&eacute;visions
sur les &eacute;volutions des logiciels libres dans le domaine de la haute
disponibilit&eacute;.
<h1>
2.&nbsp;Fonctions
sp&eacute;cifiques la haute disponibilit&eacute;</h1></UL>

<h2>
2.1.&nbsp;Pr&eacute;sentation
g&eacute;n&eacute;rale</h2>

<div>Cette partie pr&eacute;sente les fonctionnalit&eacute;s
identifi&eacute;es dans le cadre de la haute disponibilit&eacute;. Certaines
seront d&eacute;compos&eacute;es en sous-fonctions.</div>


<p>Ces fonctionnalit&eacute;s sont les suivantes :

<UL><LI>Mise
en cluster ;</UL>

<UL><LI>Disponibilit&eacute;
des donn&eacute;es ;</UL>

<UL><LI>Redondance
mat&eacute;rielle locale ;</UL>

<UL><LI>Equilibrage
de charge ;</UL>

<UL><LI>Redondance
multi-sites.
<h2>
2.2.&nbsp;Mise
en cluster</h2></UL>

<div>Ce th&egrave;me recouvre l'ensemble des fonctions
permettant la reprise d'un service assur&eacute;e par un noeud d'un cluster
par un autre noeud en cas de d&eacute;faillance mat&eacute;rielle ou logicielle.</div>


<p>Les sous-fonctions sont d&eacute;taill&eacute;es ci-dessous
:

<UL><LI>M&eacute;canisme
de reprise : tous les m&eacute;canismes permettant de reprendre un service
qui a &eacute;t&eacute; interrompu par une panne. Cela inclut le lancement
d'applications et la reprise de donn&eacute;es et d'adresses r&eacute;seau
;</UL>

<UL><LI>D&eacute;tection
de pannes : d&eacute;tection de probl&egrave;mes mat&eacute;riels ou logiciels
pouvant d&eacute;clencher une action correctrice comme par exemple le basculement
d'un service sur un noeud qui n'est pas touch&eacute; par le probl&egrave;me.
<h2>
2.3.&nbsp;Disponibilit&eacute;
des donn&eacute;es</h2></UL>

<div>Cette fonction garantit la haute disponibilit&eacute;
des donn&eacute;es stock&eacute;es sur disque, elle inclut les m&eacute;canismes
de redondance des donn&eacute;es et la reprise. Les sous-fonctions identifi&eacute;es
sont les suivantes :</div>


<UL><LI>Support
du RAID : indique le support de solutions mat&eacute;rielles existantes
RAID, ou la fourniture d'une fonctionnalit&eacute; &eacute;quivalente purement
logicielle ;</UL>

<UL><LI>Disques
partag&eacute;s entre plusieurs noeuds : support des solutions mat&eacute;rielles
de disques partag&eacute;s o&ugrave; plusieurs noeuds sont directement reli&eacute;s
aux disques concern&eacute;s ;</UL>

<UL><LI>Volumes
partag&eacute;s : pr&eacute;sence de m&eacute;canismes permettant d'utiliser
des p&eacute;riph&eacute;riques distants, ou de r&eacute;pliquer "au fil
de l'eau" un p&eacute;riph&eacute;rique local sur un noeud distant ;</UL>

<UL><LI>Haute
disponibilit&eacute; des syst&egrave;mes de fichiers distants : inclut
tous les m&eacute;canismes permettant la haute disponibilit&eacute; d'un
syst&egrave;me de fichiers distant (tel que NFS) dans le cas o&ugrave;
le serveur fournissant ce syst&egrave;me de fichiers tombe en panne ;</UL>

<UL><LI>Reprise
apr&egrave;s panne : inclut le support de m&eacute;canismes permettant
de reprendre un syst&egrave;me de fichiers apr&egrave;s un "crash" sans
perte de donn&eacute;es.
<h2>
2.4.&nbsp;Redondance
mat&eacute;rielle&nbsp;locale</h2></UL>

<div>Ce th&egrave;me consiste &agrave; &eacute;valuer
le support, par les produits &eacute;tudi&eacute;s, des solutions mat&eacute;rielles
de haute disponibilit&eacute; telles que celles trouv&eacute;es sur les
serveurs Unix haut de gamme. Les solutions mat&eacute;rielles incluent
:</div>


<UL><LI>P&eacute;riph&eacute;riques
redondants (stockage, r&eacute;seau, alimentations, CPUs, utilisation de
<i>crossbar</i> pour rendre le bus redondant ?) ;</UL>

<UL><LI>Changement
"&agrave; chaud" de p&eacute;riph&eacute;riques ;</UL>

<UL><LI>Utilisation
de <i>watchdogs
</i>(p&eacute;riph&eacute;riques permettant de d&eacute;clencher
un red&eacute;marrage mat&eacute;riel en cas de "plantage" du syst&egrave;me
d'exploitation) ;</UL>

<UL><LI>Gestion
des onduleurs ;</UL>

<UL><LI>Support
d'outils assurant l'arr&ecirc;t ou le red&eacute;marrage d'un noeud &agrave;
distance depuis une application tournant sur un noeud distant.
<h2>
2.5.&nbsp;Redondance
multi-sites</h2></UL>

<div>Cette fonction assure la haute disponibilit&eacute;
en dupliquant une application et ses donn&eacute;es sur des sites distants
reli&eacute;s par un WAN, et permet, en cas de panne sur un site, la reprise
du service fourni par l'application par un autre site.</div>

<h2>
2.6.&nbsp;Equilibrage
de charge</h2>

<div>Cette fonction permet de r&eacute;partir des requ&ecirc;tes
adress&eacute;es &agrave; un service, entre plusieurs noeuds physiques fournissant
ce service. Cette fonction est g&eacute;n&eacute;ralement utilis&eacute;e
pour des services r&eacute;seaux tels que serveurs Web, messagerie, DNS,
?</div>


<p>Elle entre dans le cadre de la haute disponibilit&eacute;
car un produit d'&eacute;quilibrage de charge ne redirigera pas les requ&ecirc;tes
vers un serveur en panne. L'int&eacute;r&ecirc;t d'une telle solution est
que la reprise est imm&eacute;diate (il n'y a pas d'application &agrave;
d&eacute;marrer sur un noeud de backup lorsqu'une panne est d&eacute;tect&eacute;e).
<h2>
2.7.&nbsp;Administration
et exploitation</h2>

<div>Cette fonction concerne l'administration et l'exploitation
des produits assurant la haute disponibilit&eacute;.</div>

<h1>
3.&nbsp;Produits</h1>

<h2>
3.1.&nbsp;Principaux
produits &eacute;tudi&eacute;s</h2>

<div>Les
produits &eacute;tudi&eacute;s sont r&eacute;capitul&eacute;s dans le tableau
suivant :</div>

<br>&nbsp;
<table BORDER CELLSPACING=0 CELLPADDING=0 >
<tr>
<td VALIGN=TOP WIDTH="189">
<center><b>Produit</b></center>
</td>

<td VALIGN=TOP WIDTH="137">
<center><b>Version</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="189">
<div>Linux</div>
</td>

<td VALIGN=TOP WIDTH="137">
<div>2.2.15</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="189">
<div>Mon</div>
</td>

<td VALIGN=TOP WIDTH="137">
<div>0.38.18</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="189">
<div>Heartbeat</div>
</td>

<td VALIGN=TOP WIDTH="137">
<div>0.4.7b</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="189">
<div>DRBD</div>
</td>

<td VALIGN=TOP WIDTH="137">
<div>0.5.5</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="189">
<div>ReiserFS</div>
</td>

<td VALIGN=TOP WIDTH="137">
<div>3.5.21-2.2.15</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="189">
<div>GFS</div>
</td>

<td VALIGN=TOP WIDTH="137">
<div>Version
du 23/11/99</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="189">
<div>LVS</div>
</td>

<td VALIGN=TOP WIDTH="137">
<div>0.9.13-2.2.15</div>
</td>
</tr>
</table>


<p>
<h3>
3.1.1.&nbsp;Linux</h3>

<h4>
3.1.1.1.&nbsp;Fonction</h4>

<div>Seules les fonctions du noyau Linux concernant directement
la haute disponibilit&eacute; sont &eacute;tudi&eacute;es dans cette partie.
Elles sont les suivantes :</div>


<UL><LI>Raid
logiciel : simulation du fonctionnement de contr&ocirc;leurs RAID uniquement
par logiciel ;</UL>

<UL><LI>Raid
mat&eacute;riel : support de solutions RAID mat&eacute;rielles (contr&ocirc;leurs
RAID) ;</UL>

<UL><LI>Gestion
des <i>watchdogs</i> : Linux supporte des solutions mat&eacute;rielles
de <i>watchdog</i> pour d&eacute;clencher le red&eacute;marrage d'une machine
en cas de "plantage".
<h4>
3.1.1.2.&nbsp;Architecture</h4></UL>

<div>Les fonctions d&eacute;crites permettent de g&eacute;rer
des p&eacute;riph&eacute;riques (disques ou <i>watchdogs</i>) locaux au
syst&egrave;me.</div>

<h4>
3.1.1.3.&nbsp;Caract&eacute;ristiques</h4>

<div><b><u>Raid
logiciel :</u></b></div>


<p>Les
types de RAID support&eacute;s sont les suivants :

<UL><LI>RAID
0 : <i>stripping
</i>: les informations sont d&eacute;coup&eacute;es en
"tranches" qui sont &eacute;clat&eacute;es entre les diff&eacute;rents
disques ou partitions utilis&eacute;s ;</UL>

<UL><LI>RAID
1 : <i>mirroring</i> simple : les m&ecirc;mes informations sont &eacute;crites
sur tous les disques ;</UL>

<UL><LI>RAID
4 : <i>stripping</i> avec utilisation d'un disque suppl&eacute;mentaire
pour stocker les informations de parit&eacute;. Ce type de RAID supporte
la panne d'un disque ;</UL>

<UL><LI>RAID
5 : comme le RAID 4, mais les informations de parit&eacute; sont r&eacute;parties
entre les disques ;</UL>

<UL><LI><i>Linear
mode</i> (il ne s'agit pas un mode RAID standard) : fonctionnalit&eacute;
&eacute;quivalente au Raid 0, mais sans <i>striping</i> (le syst&egrave;me
"voit" un volume qui est en r&eacute;alit&eacute; la concat&eacute;nation
des informations des disques physiques ou partitions utilis&eacute;s).</UL>

<p>Les diff&eacute;rences par rapport au RAID mat&eacute;riel
sont les suivantes :

<UL><LI>Le
RAID mat&eacute;riel ne s'applique qu'&agrave; des disques entiers, le
RAID logiciel peut ne comporter que certaines partitions ;</UL>

<UL><LI>Les
traitements normalement assur&eacute;s par un contr&ocirc;leur RAID sont
r&eacute;alis&eacute;s par logiciel dans le cas du RAID logiciel, ce qui
est susceptible de d&eacute;grader les performances ;</UL>

<UL><LI>Le
RAID mat&eacute;riel rend les pannes transparentes pour l'OS et les applications
(&agrave; part &eacute;ventuellement une remont&eacute;e d'alerte le cas
&eacute;ch&eacute;ant). Dans le cas du RAID logiciel, o&ugrave; l'on utilise
du mat&eacute;riel standard, certaines pannes peuvent emp&ecirc;cher le
serveur de fonctionner et n&eacute;cessitent une intervention manuelle
pour la reprise du service (arr&ecirc;t du serveur, retrait et &eacute;ventuellement
remplacement du disque fautif) ;</UL>

<UL><LI>Les
solutions de RAID logicielles ne supportent pas le "Hot-swap" (remplacement
&agrave; chaud d'un disque) ;</UL>

<UL><LI>Les
solution &agrave; base de RAID logiciel sont ind&eacute;pendantes du type
de disque utilis&eacute;. En particulier, il est possible d'utiliser des
disques IDE tr&egrave;s peu chers.</UL>

<p><b><u>RAID
mat&eacute;riel :</u></b>

<p>Le
seul contr&ocirc;leur RAID support&eacute; par Linux (version 2.2.15) est
celui de la soci&eacute;t&eacute; DPT (http://www.dpt.com/).

<p><b><u>Watchdogs
:</u></b>

<p>Le
module <i>watchdog</i> du noyau linux supporte plusieurs solutions mat&eacute;rielles
de <i>watchdog</i> (Berkshire et ICS pour la version 2.2.15). La liste
exhaustive est pr&eacute;sente dans le fichier&nbsp;Documentation/watchdog.txt
des sources du noyau Linux.

<p>Ce module permet de d&eacute;clencher un red&eacute;marrage
(<i>reset</i> mat&eacute;riel) si un applicatif ne communique plus avec
le watchdog pendant une certaine p&eacute;riode de temps configurable,
ce qui se produit dans le cas d'un "plantage" (c'est &agrave; dire un blocage
de l'ordinateur d&ucirc; &agrave; un <i>bug</i> logiciel ou un probl&egrave;me
mat&eacute;riel) : cela assure le red&eacute;marrage de l'applicatif dans
tous les cas de plantage qui n'ont pas &eacute;t&eacute; caus&eacute;s
par une d&eacute;faillance mat&eacute;rielle permanente.

<p>Il est &eacute;galement possible de simuler cette
fonction uniquement par logiciel (utilisation d'un timer), mais cette solution
s'av&egrave;re beaucoup moins fiable (beaucoup de cas de plantage vont
aussi bloquer le timer).

<p>De plus certaines des solutions mat&eacute;rielles
support&eacute;es fournissent une fonction de surveillance de la temp&eacute;rature
exploitable par un applicatif, par l'interm&eacute;diaire d'une interface
de bas niveau (<i>device</i> UNIX&nbsp;/dev/temperature).

<p><b>Remarque</b> : Les fonctions de surveillance de
temp&eacute;rature, des ventilateurs, et de d&eacute;tection d'intrusion
physique pr&eacute;sentes sur certaines cartes m&egrave;res sont utilisables
par un produit tiers lm-sensors (licence GNU : accessible &agrave; l'URL&nbsp;http://www.netroedge.com/~lm78),
non &eacute;valu&eacute;es dans cette &eacute;tude.

<p>
<h4>
3.1.1.4.&nbsp;Type
de licence</h4>

<div>Le noyau Linux est distribu&eacute; sous la licence
GNU version 2.</div>

<h4>
3.1.1.5.&nbsp;O&ugrave;
le trouver ?</h4>

<div>Le site de r&eacute;f&eacute;rence pour Linux est&nbsp;http://www.linux.org.
Ce site inclut des liens pour les documentations et le t&eacute;l&eacute;chargement.</div>

<h3>
3.1.2.&nbsp;HeartBeat</h3>

<h4>
3.1.2.1.&nbsp;Fonction</h4>

<div>Heartbeat est un outil de surveillance syst&egrave;me
et r&eacute;seau, et de reprise.</div>


<p>Il constitue l'une des r&eacute;alisations du projet
Linux-HA (www.linux-ha.org)
qui a pour but de fournir une solution de <i>clustering</i> avec haute
disponibilit&eacute; sous Linux.

<p>Il permet de g&eacute;rer un nombre quelconque de
services sur deux serveurs. Chaque service est associ&eacute; &agrave;
un serveur (serveur principal du service). En cas de panne d'un serveur,
les services associ&eacute;s &agrave; ce serveur sont d&eacute;marr&eacute;s
sur l'autre noeud (noeud de backup). Lorsque le serveur principal est &agrave;
nouveau disponible, ces services sont arr&ecirc;t&eacute;s sur le noeud
de backup et d&eacute;marr&eacute;s sur le noeud principal.

<p>Dans le cas de services r&eacute;seau, Hearbeat prend
en charge la reprise d'adresses IP et la mise &agrave; jour des caches
ARP des machines connect&eacute;es au r&eacute;seau local (clients ou routeurs)
pour qu'ils tiennent compte du basculement.
<h4>
3.1.2.2.&nbsp;Architecture</h4>

<div>Le
sch&eacute;ma suivant pr&eacute;sente l'architecture physique minimale
pour la mise en place d'un cluster utilisant Heartbeat :</div>

<center>
<p><img SRC="image003.gif" v:shapes="_x0000_i1025"></center>

<h4>
3.1.2.3.&nbsp;Caract&eacute;ristiques</h4>

<div>La version actuelle de Heartbeat ne supporte actuellement
que 2 noeuds simultan&eacute;ment, m&ecirc;me si sa conception en pr&eacute;voit
un nombre illimit&eacute;. Des versions ult&eacute;rieures devraient supprimer
cette limitation (dixit les d&eacute;veloppeurs du produit).</div>


<p>En cas de d&eacute;pendances entre plusieurs services,
on peut fixer l'ordre de d&eacute;marrage ou d'arr&ecirc;t de ces services
(quand ils ont le m&ecirc;me noeud principal).

<p>Un service peut &ecirc;tre mat&eacute;rialis&eacute;
par n'importe quelle application. La seule contrainte est de fournir un
script permettant de d&eacute;marrer, d'arr&ecirc;ter et de conna&icirc;tre
l'&eacute;tat du service (d&eacute;marr&eacute; ou arr&ecirc;t&eacute;).
Ces scripts impl&eacute;mentent la m&ecirc;me interface que les scripts
de d&eacute;marrage de la distribution RedHat (ainsi que d'autres distributions),
cela permet d'utiliser directement tous les programmes livr&eacute;s avec
des scripts respectant cette interface comme par exemple apache, samba,
named, sendmail ? sans avoir &agrave; &eacute;crire de script.

<p>Il est possible d'arr&ecirc;ter ou de d&eacute;marrer
un des serveurs manuellement, par exemple pour des op&eacute;rations de
maintenance, dans ce cas tous les services sont bascul&eacute;s sur l'autre
serveur.

<p>Heartbeat n'offre qu'un seul mode de reprise : un
service est toujours actif sur son noeud principal quand celui-ci fonctionne.

<p>La surveillance s'effectue par plusieurs canaux simultan&eacute;ment
(une ou plusieurs interfaces r&eacute;seau plus une ou plusieurs liaisons
s&eacute;rie). Cela permet de distinguer une coupure r&eacute;seau entre
les deux serveurs d'une panne mat&eacute;rielle d'un noeud. En particulier
cela &eacute;vite de se retrouver dans une situation ou les deux noeuds
lancent simultan&eacute;ment les m&ecirc;mes services. Ce m&eacute;canisme
de surveillance ne d&eacute;tecte que les pannes mat&eacute;rielles ou
les probl&egrave;mes r&eacute;seau. Il est n&eacute;cessaire d'utiliser
d'autres produits tels que Mon (cf.&nbsp;3.1.3)
pour r&eacute;aliser la surveillance applicative (ces produits peuvent
d&eacute;clencher le basculement par l'interm&eacute;diaire de scripts
fournis avec Heartbeat).

<p>Heartbeat ne g&egrave;re pas les interfaces r&eacute;seau
ou les r&eacute;seaux redondants.
<h4>
3.1.2.4.&nbsp;Type
de licence</h4>

<div>Le produit est distribu&eacute; sous la licence
GPL version 2.</div>

<h4>
3.1.2.5.&nbsp;O&ugrave;
le trouver ?</h4>

<div>Les sources du produit et sa documentation peuvent
&ecirc;tre t&eacute;l&eacute;charg&eacute;es depuis la page Web&nbsp;http://www.linux-ha.org/.</div>

<h3>
3.1.3.&nbsp;Mon</h3>

<h4>
3.1.3.1.&nbsp;Fonction</h4>

<div>Mon est un outil de monitoring g&eacute;n&eacute;raliste.
Il permet de surveiller des ressources (services r&eacute;seau, ressources
locales ?) et de d&eacute;clencher des actions selon leur &eacute;tat (lancement
de scripts, notification par E-Mail, pager, envoi de <i>traps</i> ?)</div>

<h4>
3.1.3.2.&nbsp;Architecture</h4>

<div>Mon pr&eacute;sente une architecture de type client-serveur.
Le serveur surveille les ressources et d&eacute;clenche des actions en
fonction de sa configuration et de l'&eacute;tat de ces resources.</div>


<p>Le client permet d'administrer le serveur Mon. Il
est disponible sous forme d'un outil en ligne de commande, d'une interface
Web (CGI), ou d'une API Perl.

<p>Les actions possibles depuis un client comprennent
(cette liste n'est pas exhaustive) :

<UL><LI>Marche/arr&ecirc;t
du serveur ;</UL>

<UL><LI>Marche/arr&ecirc;t
de la surveillance d'un service ;</UL>

<UL><LI>Envoi
d'un accus&eacute; de r&eacute;ception pour une alerte. Cette alerte ne
sera plus envoy&eacute;e apr&egrave;s un accus&eacute; de r&eacute;ception
;</UL>

<UL><LI>Consultation
de l'&eacute;tat des ressources surveill&eacute;es et des alertes ;</UL>

<UL><LI>D&eacute;clenchement
imm&eacute;diat du test d'une ressource ;</UL>

<UL><LI>D&eacute;clenchement
d'une alerte (pour test).
<h4>
3.1.3.3.&nbsp;Caract&eacute;ristiques</h4></UL>

<div>Mon est livr&eacute; avec plusieurs scripts standards
de surveillance de ressources : services r&eacute;seau locaux ou distants
(Telnet, FTP, NNTP, HTTP, POP3, IMAP, LDAP, DNS, SUN RPC), espace disque
local, surveillance par SNMP, base de donn&eacute;es (MySQL), latence r&eacute;seau,
imprimantes? Il est possible d'ajouter ses propres scripts ou de modifier
ceux fournis (les scripts livr&eacute;s sont &eacute;crits en PERL).</div>


<p>Les scripts d'alertes livr&eacute;s sont les suivants
: envoi de mail, envoi de <i>trap</i>, envoi de message SMS ou vers pager.
De m&ecirc;me que pour les scripts de surveillance, il est possible d'ajouter
ses propres scripts (d&eacute;clenchement d'actions correctrices ou autres
m&eacute;thodes de remont&eacute;e d'alertes).

<p>Le produit est hautement configurable : il est possible
de param&eacute;trer, pour chacune des ressources, l'intervalle de surveillance,
le d&eacute;lai de r&eacute;p&eacute;tition des alertes et le nombre d'&eacute;checs
lors de la surveillance de cette ressource avant d&eacute;clenchement de
l'alerte. Les r&egrave;gles peuvent d&eacute;pendre de la plage horaire
(par exemple les traitements peuvent &ecirc;tre diff&eacute;rents en semaine
pendant la journ&eacute;e). Pour faciliter la configuration, il est possible
de d&eacute;finir des groupes de services r&eacute;seau &agrave; surveiller,
et de fixer des d&eacute;pendances (par exemple si un routeur surveill&eacute;
tombe en panne, Mon n'enverra pas d'alertes parce qu'un serveur acc&egrave;d&eacute;
par l'interm&eacute;diaire de ce routeur n'est plus disponible).

<p>Mon surveille des ressources en parall&egrave;le.
Un seul serveur est capable de surveiller un nombre important de ressources.

<p>Les communications entre un client et un serveur sont
authentifi&eacute;es par un mot de passe (pass&eacute; en clair).

<p><b><u>Cohabitation
Mon / Heartbeat :</u></b>

<p>Le
produit Heartbeat seul ne peut suffire &agrave; la r&eacute;alisation d'un
<i>cluster</i> redondant, car il ne propose pas de fonction de surveillance
des applications. Il est possible d'utiliser en compl&eacute;ment le produit
Mon pour pallier &agrave; ce manque.

<p>Une
solution utilisant les deux produits permet par exemple de d&eacute;clencher
le basculement du <i>cluster
</i>g&eacute;r&eacute; par Heartbeat si l'application
ne fonctionne plus sur le noeud actif.

<p>L'int&eacute;gration
des deux produits est "manuelle " : il faut d&eacute;velopper le script
qui sera d&eacute;clench&eacute; par Mon en cas de probl&egrave;me applicatif
et qui lancera le basculement du cluster g&eacute;r&eacute; par Heartbeat,
par l'interm&eacute;diaire de l'interface en ligne de commande de ce dernier.
<h4>
3.1.3.4.&nbsp;Type
de licence</h4>

<div>Le produit est distribu&eacute; sous la licence
GPL version 2.</div>

<h4>
3.1.3.5.&nbsp;O&ugrave;
le trouver ?</h4>

<div>Les sources du produit et sa documentation peuvent
&ecirc;tre t&eacute;l&eacute;charg&eacute;es &agrave; l'URL&nbsp;http://www.kernel.org/software/mon/.</div>

<h3>
3.1.4.&nbsp;DRBD</h3>

<h4>
3.1.4.1.&nbsp;Fonction</h4>

<div>DRBD est un outil de r&eacute;plication de disques
&agrave; la vol&eacute;e entre deux serveurs distants (cet outil est assimilable
au RAID 1, &agrave; ceci pr&egrave;s qu'il s'applique &agrave; des disques
situ&eacute;s sur des serveurs diff&eacute;rents).</div>


<p>DRBD inclut des m&eacute;canismes de synchronisation
partielle (apr&egrave;s une d&eacute;connexion r&eacute;seau) ou compl&egrave;te
(pour une premi&egrave;re utilisation ou apr&egrave;s le changement de
l'un des disques).

<p>DRBD permet de r&eacute;aliser des clusters hautement
disponibles g&eacute;rant des donn&eacute;es dynamiques (bases de donn&eacute;es,
serveurs de fichiers ?).
<h4>
3.1.4.2.&nbsp;Architecture</h4>

<div>DRBD
s'utilise sur deux serveurs reli&eacute;s par un r&eacute;seau IP. Le sch&eacute;ma
ci-dessous illustre cette architecture :</div>

<center>
<p><img SRC="image006.gif" v:shapes="_x0000_i1026" height=252 width=272></center>


<p>

<p>En
cas de panne du serveur principal, DRBD fonctionne selon la configuration
pr&eacute;sent&eacute;e dans le sch&eacute;ma ci-dessous :
<center>
<p><img SRC="image009.gif" v:shapes="_x0000_i1027" height=252 width=280></center>


<p>DRBD se pr&eacute;sente sous la forme d'un module
noyau r&eacute;alisant la r&eacute;plication de donn&eacute;es, et d'un
outil d'administration en ligne de commande permettant de configurer et
de changer le mode (primaire/secondaire/arr&ecirc;t&eacute;) de DRBD. Toutes
les fonctions de communication sont r&eacute;alis&eacute;es de mani&egrave;re
asynchrone par des <i>threads</i> noyau, ce qui ne bloque pas les applications
locales lors d'une &eacute;criture sur un disque r&eacute;pliqu&eacute;.
<h4>
3.1.4.3.&nbsp;Caract&eacute;ristiques</h4>

<div>A un instant donn&eacute;, un seul serveur (serveur
primaire) acc&egrave;de aux donn&eacute;es (en lecture et en &eacute;criture).
On ne peut donc pas utiliser DRBD dans le cadre d'un cluster o&ugrave;
plusieurs instances d'une application sont actives (pour faire de l'&eacute;quilibrage
de charge par exemple). Dans ce cas il est conseill&eacute; d'utiliser
un produit tel que GFS, permettant d'utiliser des disques partag&eacute;s.</div>


<p>DRBD supporte les d&eacute;connexions ou les pannes
temporaires du serveur secondaire, y compris un <i>crash</i> suivi d'un
red&eacute;marrage, en conservant une copie locale des modifications. Lors
de la reconnexion, le serveur primaire renvoie toutes les mises &agrave;
jour qui ont &eacute;t&eacute; "rat&eacute;es" par le secondaire.

<p>Les m&eacute;canismes de d&eacute;tection de pannes
et le d&eacute;clenchement du basculement ne font pas partie du produit
et sont &agrave; r&eacute;aliser par ailleurs. DRBD est fourni avec des
scripts permettant de l'int&eacute;grer &agrave; Heartbeat. Dans la version
&eacute;valu&eacute;e, ces scripts peuvent amener les deux serveurs &agrave;
se retrouver simultan&eacute;ment dans le mode primaire lors d'un basculement
manuel, et n&eacute;cessitent donc d'&ecirc;tre modifi&eacute;s afin d'&eacute;viter
ce probl&egrave;me.

<p>Le produit n'assure aucune fonction relative &agrave;
la s&eacute;curit&eacute;. En particulier il n'y a pas de m&eacute;canisme
d'authentification, de contr&ocirc;le d'acc&egrave;s, d'int&eacute;grit&eacute;
ou de confidentialit&eacute; des donn&eacute;es &eacute;chang&eacute;es
sur le r&eacute;seau.

<p>Dans le cas o&ugrave; les deux serveurs tentent de
devenir primaires simultan&eacute;ment, le produit s'arr&ecirc;te imm&eacute;diatement
de fonctionner (ce cas ne doit pas se produire en fonctionnement normal,
mais ceci garantit que s'il se produit, les donn&eacute;es ne sont pas
perdues)

<p>DRBD
propose trois protocoles diff&eacute;rents pour la transmission de donn&eacute;es
(par ordre d&eacute;croissant de performance) :
<br>&nbsp;
<table BORDER CELLSPACING=0 CELLPADDING=0 >
<tr>
<td VALIGN=TOP WIDTH="99">
<center><b>Protocole</b></center>
</td>

<td VALIGN=TOP WIDTH="425">
<center><b>Description</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="99">
<center>A</center>
</td>

<td VALIGN=TOP WIDTH="425">
<div>Une
op&eacute;ration d'&eacute;criture est consid&eacute;r&eacute;e comme termin&eacute;e
avec succ&egrave;s d&egrave;s que les donn&eacute;es sont &eacute;crites
sur le disque local et envoy&eacute;es sur le r&eacute;seau vers le noeud
secondaire</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="99">
<center>B</center>
</td>

<td VALIGN=TOP WIDTH="425">
<div>Une op&eacute;ration d'&eacute;criture est consid&eacute;r&eacute;e
comme termin&eacute;e avec succ&egrave;s d&egrave;s que les donn&eacute;es
sont &eacute;crites sur le disque local et que le noeud secondaire a accus&eacute;
r&eacute;ception des donn&eacute;es</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="99">
<center>C</center>
</td>

<td VALIGN=TOP WIDTH="425">
<div>Une
op&eacute;ration d'&eacute;criture est consid&eacute;r&eacute;e comme termin&eacute;e
avec succ&egrave;s d&egrave;s que les donn&eacute;es sont &eacute;crites
sur le disque local et que le noeud secondaire a indiqu&eacute; qu'il a
&eacute;crit les donn&eacute;es sur son disque</div>
</td>
</tr>
</table>


<p>Seul
le protocole C garantit que, en cas de crash du serveur primaire, aucune
&eacute;criture ayant abouti sur le primaire ne sera perdue lors de la
reprise par le secondaire. Cela est expliqu&eacute; dans le sch&eacute;ma
suivant :
<center>
<p><img SRC="image012.gif" v:shapes="_x0000_i1028"></center>


<p>Ce sch&eacute;ma correspond &agrave; l'utilisation
du protocole C (attente de l'&eacute;criture pour accuser r&eacute;ception
de la notification), o&ugrave; les caches disque en &eacute;criture sont
d&eacute;sactiv&eacute;s (voir remarque importante 2 plus loin).

<p>

<p><b>Remarque
importante 1 :</b> lors de la reprise par le secondaire apr&egrave;s un
crash du primaire, la partition r&eacute;pliqu&eacute;e est r&eacute;cup&eacute;r&eacute;
"en l'&eacute;tat" telle qu'elle &eacute;tait &agrave; l'instant du crash.
On se trouve ainsi dans le m&ecirc;me cas que lors de la reprise d'une
partition locale apr&egrave;s un crash. Un solution utilisant DRBD doit
donc inclure des m&eacute;canisme de reprise de donn&eacute;es, comme par
exemple :

<UL><LI>La
partition est utilis&eacute;e par une base de donn&eacute;es comprenant
ses propres m&eacute;canismes de reconstruction des donn&eacute;es (par
exemple Oracle) ;</UL>

<UL><LI>Utilisation
d'un syst&egrave;me de fichiers classique avec v&eacute;rification et r&eacute;paration
lors de la reprise (fsck). Cela peut s'av&eacute;rer p&eacute;nalisant
en termes de performances et n'offre pas de garantie de r&eacute;ussite
;</UL>

<UL><LI>Utilisation
d'un syst&egrave;me de fichiers journalis&eacute; assurant une reprise
tr&egrave;s rapide du syst&egrave;me de fichiers et garantit qu'il est
dans un &eacute;tat coh&eacute;rent vis-&agrave;-vis du syst&egrave;me
(mais pas forc&eacute;ment des applications).</UL>

<p>Dans
les deux derniers cas, les applications g&eacute;rant leurs donn&eacute;es
doivent elles aussi poss&eacute;der un m&eacute;canisme de reprise de leurs
donn&eacute;es : par exemple, une application qui &eacute;tait en train
d'&eacute;crire un fichier au moment du <i>crash</i> pourra retrouver un
fichier tronqu&eacute; lors de son d&eacute;marrage sur le secondaire.

<p>

<p><b>Remarque importante 2 : </b>les syst&egrave;mes
d'exploitation retardent g&eacute;n&eacute;ralement les &eacute;critures
sur disque pour des raisons de performances. Un tel m&eacute;canisme doit
&ecirc;tre d&eacute;sactiv&eacute; sur une partition r&eacute;pliqu&eacute;e
par DRBD (utilisation de l'option de montage "sync" sous Linux, ou utilisation
d'une application qui force la mise &agrave; jour imm&eacute;diate du disque
lors d'une &eacute;criture comme par exemple l'annuaire OpenLDAP ou toute
application stockant ses donn&eacute;es dans une base gdbm). De la m&ecirc;me
mani&egrave;re, tous les m&eacute;canismes de caches en &eacute;criture
(<i>write-back caching</i>) impl&eacute;ment&eacute;s sur les contr&ocirc;leurs
de disques ou les disques eux-m&ecirc;mes doivent &ecirc;tre d&eacute;sactiv&eacute;s.

<p>Les produits g&eacute;rant eux m&ecirc;me leur cache
en &eacute;criture de fa&ccedil;on &agrave; permettre une reprise apr&egrave;s
un <i>crash</i> (c'est par exemple le cas d'Oracle) peuvent &ecirc;tre
utilis&eacute;s avec DRBD, mais cela peut impliquer un impact sur les performances
(un appel syst&egrave;me qui r&eacute;alise effectivement l'&eacute;criture
sur disque, tel qu'un <i>sync </i>ou une &eacute;criture quand le cache
du syst&egrave;me est d&eacute;sactiv&eacute;, restera bloqu&eacute; tant
que l'&eacute;criture n'a pas &eacute;t&eacute; r&eacute;alis&eacute;e
et acquitt&eacute;e par le noeud secondaire).

<p>

<p>La <i>roadmap </i>du produit indique que les versions
futures pr&eacute;voient le <i>mirroring</i> simultan&eacute; sur plusieurs
serveurs secondaires distant (utilisation du multicast).
<h4>
3.1.4.4.&nbsp;Type
de licence</h4>

<div>Le produit est distribu&eacute; sous la licence
GPL version 2.</div>

<h4>
3.1.4.5.&nbsp;O&ugrave;
le trouver ?</h4>

<div>Les sources du produit et sa documentation peuvent
&ecirc;tre t&eacute;l&eacute;charg&eacute;es &agrave; l'URL&nbsp;http://www.complang.tuwien.ac.at/reisner/drbd/.</div>

<h3>
3.1.5.&nbsp;ReiserFS</h3>

<h4>
3.1.5.1.&nbsp;Fonction</h4>

<div>ReiserFS est un syst&egrave;me de fichiers journalis&eacute;.</div>

<h4>
3.1.5.2.&nbsp;Architecture</h4>

<div>ReiserFS se compose d'un module noyau ajoutant le
support du syst&egrave;me de fichiers ReiserFS au noyau.</div>

<h4>
3.1.5.3.&nbsp;Caract&eacute;ristiques</h4>

<div>Pour des raisons de performances, l'ensemble des
op&eacute;rations sur disque ne sont pas journalis&eacute;es. Seules les
op&eacute;rations modifiant des m&eacute;ta-donn&eacute;es (superblock,
inodes, bitmap des blocs disque, r&eacute;pertoires) le sont. Les cons&eacute;quences
sont les suivantes :</div>


<UL><LI>Apr&egrave;s
une reprise d'un syst&egrave;me de fichiers, ReiserFS garantit que l'ensemble
des m&eacute;ta-donn&eacute;es sont r&eacute;cup&eacute;r&eacute;es dans
un &eacute;tat coh&eacute;rent. En particulier l'arborescence des fichiers
pr&eacute;sents n'est pas impact&eacute;e. Apr&egrave;s un re-jeu du log
lors du montage de la partition, le syst&egrave;me de fichiers ne pr&eacute;sente
pas d'erreurs et ne n&eacute;cessite donc pas de r&eacute;paration (de
type <i>fsck</i>) ;</UL>

<UL><LI>Cependant,
les modifications des donn&eacute;es elles m&ecirc;mes ne sont pas journalis&eacute;es.
Apr&egrave;s une reprise, les fichiers qui &eacute;taient en cours de modification
au moment d'un crash sont dans un &eacute;tat ind&eacute;termin&eacute;.</UL>

<p>D'autres produits fournissent une fonction de journalisation
compl&egrave;te (tel que par exemple le syst&egrave;me de fichiers ext3).
Ces produits ne se situent pas &agrave; un stade tr&egrave;s avanc&eacute;
de r&eacute;alisation. Pour de la journalisation dans le cadre de disques
partag&eacute;s, voir GFS (partie&nbsp;3.1.6).

<p>ReiserFS peut &ecirc;tre utilis&eacute; comme syst&egrave;me
de fichiers de <i>boot </i>(syst&egrave;me de fichiers contenant le r&eacute;pertoire
racine) sur un syst&egrave;me Linux.
<h4>
3.1.5.4.&nbsp;Type
de licence</h4>

<div>ReiserFS est distribu&eacute; sous la licence GPL
version 2.</div>

<h4>
3.1.5.5.&nbsp;O&ugrave;
le trouver ?</h4>

<div>Les sources du produit et sa documentation peuvent
&ecirc;tre t&eacute;l&eacute;charg&eacute;es &agrave; l'URL&nbsp;http://devlinux.com/projects/reiserfs/.</div>

<h3>
3.1.6.&nbsp;GFS</h3>

<h4>
3.1.6.1.&nbsp;Fonction</h4>

<div>GFS est un syst&egrave;me de fichiers pr&eacute;vu
pour &ecirc;tre utilis&eacute; sur des disques partag&eacute;s (<i>i.e.</i>
reli&eacute;s physiquement &agrave; plusieurs serveurs) sous Linux. Les
disques peuvent &ecirc;tre acc&eacute;d&eacute;s simultan&eacute;ment en
lecture et en &eacute;criture depuis tous les serveurs qui leur sont connect&eacute;s.</div>


<p>GFS fournit en plus une fonction de journalisation.
<h4>
3.1.6.2.&nbsp;Architecture</h4>

<div>Le
sch&eacute;ma ci-dessous pr&eacute;sente l'architecture requise pour utiliser
GFS :</div>

<center>
<p><img SRC="image015.gif" v:shapes="_x0000_i1029"></center>


<p>GFS
supporte un nombre quelconque de clients reli&eacute;s &agrave; un ou plusieurs
disques par 'un moyen de communication pouvant &ecirc;tre l'un des suivants
:

<UL><LI>Un
bus SCSI ;</UL>

<UL><LI>Un
r&eacute;seau Fibre Channel ;</UL>

<UL><LI>Un
r&eacute;seau IP. Dans ce cas, il faut adopter une solution permettant
d'utiliser un disque distant par l'interm&eacute;diaire d'un r&eacute;seau
IP. Les solutions possibles comprennent NBD (Network Block Device) livr&eacute;
en standard avec Linux, ou GNBD, en cours de d&eacute;veloppement par l'&eacute;quipe
qui a r&eacute;alis&eacute; GFS.</UL>

<p>GFS permet d'acc&eacute;der des disques simples ou
des baies RAID.

<p>GFS se pr&eacute;sente sous la forme d'un module ajoutant
le support du syst&egrave;me de fichiers GFS et d'utilitaires permettant
la cr&eacute;ation et la gestion de disques ou de partitions partag&eacute;s.
<h4>
3.1.6.3.&nbsp;Caract&eacute;ristiques</h4>

<div>GFS s'appuie sur un m&eacute;canisme de verrous
nomm&eacute; Dlock. Ce m&eacute;canisme n&eacute;cessite l'impl&eacute;mentation,
au niveau du disque ou de la baie de disques, d'une nouvelle commande SCSI
permettant de poser ou retirer un verrou sur une partie du disque, ou de
consulter l'&eacute;tat des verrous. L'ensemble des informations concernant
les verrous est stock&eacute; au niveau du disque ou de la baie. Dlock
permet aux clients de conserver des caches locaux &agrave; l'aide d'un
m&eacute;canisme de <i>callbacks</i> destin&eacute;s &agrave; notifier
un client si une donn&eacute;e qu'il a conserv&eacute; dans son cache a
&eacute;t&eacute; modifi&eacute;e.</div>


<p>La sp&eacute;cification de
Dlock est pr&eacute;sente &agrave; l'URL&nbsp;http://www.globalfilesystem.org/Pages/dlock.html.

<p>Elle a &eacute;t&eacute; impl&eacute;ment&eacute;e
par plusieurs constructeurs de disques (Seagate, Silicon Gear) ou de baies
RAID (Dot Hill). Les versions du <i>firmware</i> pour ces produits avec
le support de la sp&eacute;cification Dlock et les outils de mise &agrave;
jour sont disponibles sur le site Web de GFS.

<p>Dans le cas ou Dlock ne serait pas support&eacute;
par les disques ou les baies de disques, il est possible d'utiliser une
solution uniquement logicielle (produit GLMD) int&eacute;gr&eacute;e &agrave;
la distribution GFS, mais qui est encore en cours de d&eacute;veloppement.

<p>La plus grosse configuration bas&eacute;e sur GFS
a &eacute;t&eacute; pr&eacute;sent&eacute;e &agrave; la Linux World Expo
2000, et comprenait 16 clients et 64 disques r&eacute;partis en 8 baies,
le tout reli&eacute; par Fibre Channel.

<p>La fonctionnalit&eacute; de journalisation est en
phase de d&eacute;veloppement actuellement.
<h4>
3.1.6.4.&nbsp;Type
de licence</h4>

<div>GFS est distribu&eacute; sous la licence GPL version
2.</div>

<h4>
3.1.6.5.&nbsp;O&ugrave;
le trouver ?</h4>

<div>Le produit GFS ainsi que sa documentation sont disponibles
&agrave; l'URL&nbsp;http://www.globalfilesystem.org/.</div>

<h3>
3.1.7.&nbsp;LVS</h3>

<h4>
3.1.7.1.&nbsp;Fonction</h4>

<div>LVS (Linux Virtual Server) est un outil d'&eacute;quilibrage
de charge pour des services r&eacute;seau. Il permet de r&eacute;partir
des requ&ecirc;tes Web, SMTP, ou n'importe quel autre protocole TCP/IP,
entre plusieurs serveurs fournissant le service. Ce m&eacute;canisme est
transparent pour les clients qui ne voient qu'une seule adresse.</div>


<p>Deux solutions compl&egrave;tes bas&eacute;es sur
LVS sont en cours de d&eacute;veloppement :

<UL><LI>Virtual
Monkey, r&eacute;alis&eacute; par la soci&eacute;t&eacute; VA Linux compte
proposer un produit int&eacute;grant LVS et Heartbeat pour fournir une
solution compl&egrave;te pour la mise en place de "fermes de serveurs".</UL>

<UL><LI>Piranha,
inclu avec la distribution RedHat, fournit en plus de LVS un outil permettant
d'assurer la haute disponibilit&eacute; du noeud dispatcher lui-m&ecirc;me
et une interface d'administration accessible depuis un browser Web (voir
copie d'&eacute;cran ci-dessous). Cette interface permet de configurer
le noeud dispatcher, et &eacute;ventuellement un noeud de backup, de consulter
l'&eacute;tat des serveurs, d'ajouter ou supprimer des serveurs.</UL>

<p>Ces deux produit sont distribu&eacute;s sous licence
GPL.

<p>La
copie d'&eacute;cran ci-dessous pr&eacute;sente l'interface Web de Piranha
:
<center>
<p><img SRC="image017.gif" v:shapes="_x0000_i1030" height=354 width=457></center>


<p>
<h4>
3.1.7.2.&nbsp;Architecture</h4>

<div>LVS supporte trois architectures :</div>


<UL><LI>Serveurs
virtuels avec translation d'adresse (NAT) ;</UL>

<UL><LI>Serveurs
virtuels avec tunneling IP ;</UL>

<UL><LI>Serveurs
virtuels avec routage direct.</UL>

<p>Ces
trois solutions sont d&eacute;crites ci-dessous.

<p>

<p>Les
sch&eacute;mas pr&eacute;sent&eacute;s dans les parties suivantes comportent
un serveur <i>dispatcher</i> de <i>backup</i>. Le m&eacute;canisme de <i>backup</i>
ne fait pas partie du produit LVS standard, mais est inclus dans les solutions
compl&egrave;tes Piranha et Ultramonkey.

<p>

<p>

<p><b><u>Translation
d'adresses (NAT)</u></b>

<p>Le
sch&eacute;ma suivant pr&eacute;sente l'architecture r&eacute;seau dans
le cadre de la solution avec translation d'adresses. Cette solution montre
un fonctionnement &eacute;quivalent &agrave; celui du produit commercial
CISCO Local Director.
<center>
<p><img SRC="image020.gif" v:shapes="_x0000_i1031" height=393 width=268></center>


<p>Le noeud dispatcher r&eacute;alise la translation
des adresses source et destination pour les paquets entrants et sortants.

<p><b>Avantage :</b>

<UL><LI>Aucune
contrainte au niveau des serveurs pour qui la solution semble transparente
(du point de vue du serveur, les requ&ecirc;tes semblent venir du noeud
<i>dispatcher</i>).</UL>

<p><b>Inconv&eacute;nient :&nbsp;</b>

<UL><LI>Faible
"scalabilit&eacute;" : le noeud dispatcher doit r&eacute;aliser la translation
d'adresses pour tous les paquets entrants et sortants.</UL>

<p><b><u>Tunneling
IP</u></b>

<p>L'architecture
r&eacute;seau, dans la solution avec tunneling IP, est la m&ecirc;me que
dans le cas de la translation d'adresse (voir ci-dessus).

<p>Le
dispatcher encapsule les paquets en provenance du client qui lui sont donc
destin&eacute;s, dans un paquet IP qu'il envoie au serveur qu'il a choisi.
Le sch&eacute;ma suivant illustre le format d'un paquet IP entrant (envoy&eacute;
par le dispatcher &agrave; un serveur) :
<center>
<p><img SRC="image023.gif" v:shapes="_x0000_i1032"></center>


<p>Les
paquets IP sortants (envoy&eacute;s par les serveurs vers un client) sont
relay&eacute;s par le <i>dispatcher</i> &agrave; l'aide du m&eacute;canisme
de routage IP standard.

<p><b>Avantage
:</b>

<UL><LI>Permet
d'utiliser une architecture avec deux r&eacute;seaux physiquement s&eacute;par&eacute;s
comme dans la solution NAT, mais avec un impact moindre sur les performances
: seuls les paquets entrants doivent &ecirc;tre r&eacute;&eacute;crits,
les paquets sortants sont achemin&eacute;s par le m&eacute;canisme de routage
IP standard par le noeud dispatcher.</UL>

<p><b>Inconv&eacute;nients :</b>

<UL><LI>Les
serveurs doivent supporter l'encapsulation IP/IP. Aujourd'hui seul Linux
le supporte ;</UL>

<UL><LI>Contrainte
sur les serveurs : ils doivent poss&eacute;der une "adresse IP virtuelle"
(par exemple une IP sur l'interface <i>loopback</i>) identique &agrave;
celle utilis&eacute;e par le client, pour pouvoir accepter les paquets
encapsul&eacute;s.</UL>

<p><b><u>Routage
direct</u></b>

<p>Le
sch&eacute;ma suivant pr&eacute;sente l'architecture r&eacute;seau dans
le cadre de la solution avec routage direct. Elle pr&eacute;sente un fonctionnement
&eacute;quivalent &agrave; celui du produit commercial Network Dispatcher
d'IBM.
<center>
<p><img SRC="image026.gif" v:shapes="_x0000_i1033" height=279 width=400></center>


<p>Dans
cette configuration seuls les paquets IP en provenance des clients sont
trait&eacute;s par le dispatcher. Les paquets &agrave; destination du client
ne passent pas par le dispatcher. De m&ecirc;me que dans la solution pr&eacute;c&eacute;dente,
les serveurs doivent avoir une adresse IP virtuelle qui est la m&ecirc;me
que celle du dispatcher.

<p><b>Avantage
:</b>

<UL><LI>Meilleure
performances et "scalabilit&eacute;" : seuls les paquets entrants sont
trait&eacute;s par le <i>dispatcher</i>.</UL>

<p><b>Inconv&eacute;nients
:</b>

<UL><LI>Le
<i>dispatcher</i> et les serveurs doivent tous se trouver sur le m&ecirc;me
r&eacute;seau ethernet physique ;</UL>

<UL><LI>Contrainte
sur les serveurs : ils doivent avoir une "adresse IP virtuelle" (par exemple
une IP sur l'interface <i>loopback</i>) identique &agrave; celle utilis&eacute;e
par le client, pour pouvoir accepter les paquets encapsul&eacute;s.</UL>

<p>
<h4>
3.1.7.3.&nbsp;Caract&eacute;ristiques</h4>

<div>Les
crit&egrave;res suivants sont exploitables par LVS pour s&eacute;lectionner
le serveur recevant une requ&ecirc;te :</div>


<UL><LI>Round-Robin
: les requ&ecirc;tes sont renvoy&eacute;es vers chacun des serveurs ind&eacute;pendamment
de leur charge ou du nombre de connexions ;</UL>

<UL><LI>Round-Robin
avec pond&eacute;ration : m&ecirc;me principe que le Round-Robin simple,
mais certains serveurs sont plus sollicit&eacute;s que d'autres (selon
des coefficients fix&eacute;s par l'administrateur) ;</UL>

<UL><LI>Selon
le nombre de connexions actives : le serveur poss&eacute;dant le moins
de connexions actives re&ccedil;oit la requ&ecirc;te ;</UL>

<UL><LI>Selon
le nombre de connexions actives avec pond&eacute;ration : m&ecirc;me principe
que le crit&egrave;re pr&eacute;c&eacute;dent, mais des coefficients sont
appliqu&eacute;s aux nombres de connexions pour chaque serveur.</UL>

<p>Il n'est pas possible d'obtenir des crit&egrave;res
d&eacute;pendant de l'&eacute;tat des serveurs (charge, occupation CPU?).

<p>

<p>Les fonctions de haute disponibilit&eacute; (dispatcher
redondant et d&eacute;tection des serveurs en panne) ne sont pas incluses
dans la version standard de base de LVS, mais sont fournies avec les solutions
compl&egrave;tes pr&eacute;sent&eacute;es au&nbsp;3.1.7.1.

<p>

<p><b>Remarque importante :
</b>certains syst&egrave;mes
d'exploitation r&eacute;pondent &agrave; des requ&ecirc;tes ARP arrivant
sur une interface diff&eacute;rente de celle de l'adresse demand&eacute;e.
C'est en particulier le cas des versions 2.2.x de Linux. Ces syst&egrave;mes
ne peuvent pas &ecirc;tre utilis&eacute;s comme serveurs dans les architectures
avec <i>tunneling</i> ou routage direct. Pour Linux 2.2.x un patch est
disponible sur le site de LVS afin de corriger ce probl&egrave;me.
<h4>
3.1.7.4.&nbsp;Type
de licence</h4>

<div>LVS est distribu&eacute; sous la licence GPL version
2.</div>

<h4>
3.1.7.5.&nbsp;O&ugrave;
le trouver ?</h4>

<div>Les sources du produit et sa documentation peuvent
&ecirc;tre t&eacute;l&eacute;charg&eacute;es &agrave; l'URL&nbsp;http://www.linuxvirtualserver.org/.</div>


<p>UltraMonkey est accessible &agrave; l'URL&nbsp;http://ultramonkey.sourceforge.net/.

<p>Piranha est inclus dans les distributions RedHat 6.1
et ult&eacute;rieures. Le produit est pr&eacute;sent&eacute; &agrave; l'URL&nbsp;http://www.redhat.com/support/wpapers/paranha/x32.html.

<p>
<h2>
3.2.&nbsp;Couverture
fonctionnelle des produits</h2>

<div>Le
tableau ci-dessous pr&eacute;sente, pour chacune des fonctions, la liste
des produits qui assurent cette fonction, parmi ceux &eacute;tudi&eacute;s
dans ce document.</div>

<br>&nbsp;
<table BORDER CELLSPACING=0 CELLPADDING=0 >
<caption><thead>
<br></thead></caption>

<tr>
<td VALIGN=TOP WIDTH="211">
<center><b>Fonctions</b></center>
</td>

<td VALIGN=TOP WIDTH="333">
<center><b>Logiciels libre fournissant cette fonction</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP COLSPAN="2" WIDTH="543">
<center><b>Mise en cluster</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

M&eacute;canismes
de reprise
</td>

<td VALIGN=TOP WIDTH="333">
<div>Heartbeat</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

D&eacute;tection
de panne
</td>

<td VALIGN=TOP WIDTH="333">
<div>Heartbeat,
Mon</div>
</td>
</tr>

<tr>
<td VALIGN=TOP COLSPAN="2" WIDTH="543">
<center><b>Disponibilit&eacute; des donn&eacute;es</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

Support
du RAID
</td>

<td VALIGN=TOP WIDTH="333">
<div>Linux
(pour RAID mat&eacute;riel et logiciel)</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

Disques
partag&eacute;s
</td>

<td VALIGN=TOP WIDTH="333">
<div>GFS</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

Volumes
partag&eacute;s
</td>

<td VALIGN=TOP WIDTH="333">
<div>DRBD</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

Haute
disponibilit&eacute; des syst&egrave;mes de fichiers
</td>

<td VALIGN=TOP WIDTH="333">
<div>ReiserFS</div>
</td>
</tr>

<tr>
<td VALIGN=TOP COLSPAN="2" WIDTH="543">
<center><b>Equilibrage de charge</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

Equilibrage
de charge
</td>

<td VALIGN=TOP WIDTH="333">
<div>LVS</div>
</td>
</tr>

<tr>
<td VALIGN=TOP COLSPAN="2" WIDTH="543">
<center><b>Redondance mat&eacute;rielle locale</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

Redondance
mat&eacute;rielle locale
</td>

<td VALIGN=TOP WIDTH="333">
<div>Linux</div>
</td>
</tr>

<tr>
<td VALIGN=TOP COLSPAN="2" WIDTH="543">
<center><b>Redondance multi-site</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Redondance
multi-site</div>
</td>

<td VALIGN=TOP WIDTH="333">

<i>Aucun</i>
</td>
</tr>
</table>


<p>
<h2>
3.3.&nbsp;Aspects
relatifs &agrave; la s&eacute;curit&eacute;</h2>

<div>Cette partie pr&eacute;sente les diff&eacute;rents
probl&egrave;mes li&eacute;s &agrave; la s&eacute;curit&eacute; dans le
cadre de l'utilisation des produits &eacute;tudi&eacute;s :</div>


<p><b><u>Authentification</u></b>

<p>Les
produits qui communiquent entre noeuds d'un <i>cluster</i> utilisent des
m&eacute;canismes d'authentification variables :

<UL><LI>Hearbeat
permet d'authentifier les paquets de surveillance &agrave; l'aide d'une
clef connue par chacun des serveurs et d'une fonction de hachage (MD5 ou
SHA). Cependant ce m&eacute;canisme ne prot&egrave;ge pas du re-jeu. On
peut par exemple envisager une attaque de type d&eacute;ni de service en
envoyant p&eacute;riodiquement des paquets de <i>ping</i> pr&eacute;alablement
"renifl&eacute;s" pour faire croire qu'un noeud en panne fonctionne toujours
;</UL>

<UL><LI>Mon
authentifie ses client par un nom d'utilisateur et un mot de passe qui
sont transmis en clair sur le r&eacute;seau ;</UL>

<UL><LI>DRBD
ne poss&egrave;de aucun m&eacute;canisme d'authentification pour ses paquets
de mise &agrave; jour du disque secondaire et d'acquittement. En particulier,
il est tr&egrave;s ais&eacute; de produire des "faux" paquets pour modifier
le contenu du disque secondaire.</UL>

<p><b><u>Contr&ocirc;le
d'acc&egrave;s</u></b>

<p>Aucun
produit ne fournit de fonction de contr&ocirc;le d'acc&egrave;s pour ses
&eacute;changes r&eacute;seau : les paquets authentifi&eacute;s sont toujours
accept&eacute;s.

<p>Dans le cadre de l'utilisation de DRBD, l'authentification
sur les syst&egrave;mes de fichiers Unix est bas&eacute;e sur les UID.
Les UID doivent donc &ecirc;tre les m&ecirc;mes sur les deux serveurs.

<p><b><u>Int&eacute;grit&eacute;</u></b>

<p>Hormis
Heartbeat qui utilise MD5 ou SHA pour signer ses paquets, aucun des produits
ne propose de fonction assurant l'int&eacute;grit&eacute; des donn&eacute;es
&eacute;chang&eacute;es.

<p>En
particulier, DRBD ne garantit pas l'int&eacute;grit&eacute; des informations
&eacute;crites sur le disque du noeud secondaire.

<p><b><u>Confidentialit&eacute;
:</u></b>

<p>Aucun
des produits &eacute;tudi&eacute;s ne propose de m&eacute;canisme pour
assurer la confidentialit&eacute; des donn&eacute;es. En particulier, si
on utilise DRBD, on peut reconstituer le disque r&eacute;pliqu&eacute;
ou une partie de celui-ci en "reniflant" suffisamment de paquets &eacute;chang&eacute;s.

<p><b><u>Solutions
:</u></b>

<p>Ce
paragraphe pr&eacute;sente des solutions destin&eacute;es &agrave; s&eacute;curiser
l'utilisation des produits &eacute;tudi&eacute;s :

<p><u>1<sup>&egrave;re</sup>
solution : s&eacute;curit&eacute; de p&eacute;rim&egrave;tre :</u>

<p>Cette
solution consiste &agrave; intercaler un <i>firewall </i>entre le <i>cluster</i>
de serveurs hautement disponibles et l'ext&eacute;rieur.
<center>
<p><img SRC="image029.gif" v:shapes="_x0000_i1034"></center>


<p>Cette
configuration garantit que seules les requ&ecirc;tes autoris&eacute;es
venant des clients atteignent les noeuds composant le <i>cluster</i>. En
particulier, un client connect&eacute; au r&eacute;seau non s&eacute;curis&eacute;
ne peut pas interf&eacute;rer avec les produits assurant la haute disponibilit&eacute;.

<p>

<p><u>2<sup>&egrave;me</sup>
solution : utilisation des r&eacute;seaux physiques distincts :</u>

<p>Une
autre possibilit&eacute; consiste &agrave; utiliser des r&eacute;seaux
physiques diff&eacute;rents pour les informations sensibles ou pour les
applications dont les communications ne sont pas prot&eacute;g&eacute;es
par des m&eacute;canismes de s&eacute;curit&eacute; suffisants. Le sch&eacute;ma
ci-dessous pr&eacute;sente un exemple de cluster s&eacute;curis&eacute;
:
<center>
<p><img SRC="image032.gif" v:shapes="_x0000_i1035"></center>


<p>

<p>Les
pr&eacute;cautions suivantes doivent &ecirc;tre prises :

<UL><LI>D&eacute;sactiver
les m&eacute;canismes de routage sur les serveurs reli&eacute;s aux deux
r&eacute;seaux ;</UL>

<UL><LI>Mettre
en place des r&egrave;gles de filtrage IP sur ces serveurs pour interdire
des connexions vers les outils utilisant le r&eacute;seau priv&eacute;
par l'interm&eacute;diaire de l'interface reli&eacute;e au r&eacute;seau
public.</UL>

<p>Ce type d'architecture est support&eacute; par tout
les produits &eacute;tudi&eacute;s.

<p>

<p>Les deux solutions pr&eacute;sent&eacute;es ci-dessus
ne sont pas exclusives et il est possible de les combiner.
<br>
<br>
<h1>
4.&nbsp;Comparaison</h1>

<h2>
4.1.&nbsp;Crit&egrave;res</h2>

<div>Les produits seront &eacute;valu&eacute;s selon
deux groupes de crit&egrave;res d&eacute;crits dans les paragraphes suivants
:</div>


<UL><LI>Crit&egrave;res
fonctionnels ;</UL>

<UL><LI>Crit&egrave;res
g&eacute;n&eacute;raux.
<h3>
4.1.1.&nbsp;Crit&egrave;res
fonctionnels</h3></UL>

<div>Les fonctionnalit&eacute;s &agrave; &eacute;valuer
sont celles pr&eacute;sent&eacute;es au chapitre 2. Le r&eacute;sultat
de cette &eacute;valuation indiquera quelles sont les possibilit&eacute;s
offertes par le produit.</div>


<p>Cette partie d&eacute;crit plus pr&eacute;cis&eacute;ment
quels points seront consid&eacute;r&eacute;s pour chacune des fonctions
et &eacute;ventuellement sous-fonctions &eacute;tudi&eacute;s et de quelle
fa&ccedil;on il seront &eacute;valu&eacute;s.
<h4>
4.1.1.1.&nbsp;Mise
en cluster</h4>

<div>Les points suivants seront &eacute;valu&eacute;s
:</div>


<p><b><u>M&eacute;canismes de reprise :</u></b>

<UL><LI>Support
de diff&eacute;rents modes de "clust&eacute;risation" (attente active,
"failover" en cascade?) ;</UL>

<UL><LI>Nombre
maximal de noeuds support&eacute;s ;</UL>

<UL><LI>S&eacute;lection
dynamique du noeud de backup &agrave; utiliser en cas de panne (quels sont
les crit&egrave;res de s&eacute;lection, est-il possible d'en ajouter ?)
;</UL>

<UL><LI>Compatibilit&eacute;
avec les produits d'&eacute;quilibrage de charge existants : support d'instances
multiples de services, remont&eacute;e d'informations (tels que charge
CPU, noeud op&eacute;rationnel ou non?) du cluster vers l'&eacute;quilibreur
de charge, liste des produits support&eacute;s ;</UL>

<UL><LI>Actions
correctrices possibles : traitements que le produit peut d&eacute;clencher
automatiquement en cas de panne (basculement, red&eacute;marrage d'application
?). Support de plusieurs actions correctrices (par exemple si un service
ne r&eacute;pond pas, le service est red&eacute;marr&eacute;, et si cela
&eacute;choue le noeud est red&eacute;marr&eacute;).</UL>

<p><b><u>D&eacute;tection de pannes :</u></b>

<UL><LI>D&eacute;tection
de pannes logicielles : capacit&eacute; &agrave; d&eacute;tecter un probl&egrave;me
(application ou service r&eacute;seau d&eacute;faillant ou arr&ecirc;t&eacute;)
sans modifier l'application. Quels sont les applications ou services r&eacute;seau
surveill&eacute;s ? ;</UL>

<UL><LI>D&eacute;tection
de pannes mat&eacute;rielles : quels sont les types de pannes qui peuvent
&ecirc;tre d&eacute;tect&eacute;s et peut-on d&eacute;clencher une action
de basculement vers un autre noeud ? m&eacute;canismes de d&eacute;tection,
support de chemins multiples pour la d&eacute;tection de noeuds en panne
;</UL>

<UL><LI>D&eacute;tection
de probl&egrave;mes de ressources : d&eacute;clenchement du basculement
sur des crit&egrave;res tels que charge, espace disque ou m&eacute;moire
?. ;</UL>

<UL><LI>Interfaces
: existence d'une interface (API ou outils en ligne de commande) permettant
aux applications de d&eacute;clencher un basculement ou consulter l'&eacute;tat
du cluster.</UL>

<UL><LI>Extensibilit&eacute;
: ajout par l'administrateur de crit&egrave;res de basculement, de m&eacute;canismes
de d&eacute;tection de panne, d'actions correctrices (ajout possible de
scripts personnalis&eacute;s) ? ;</UL>

<UL><LI>R&eacute;glages
possibles : quels sont les param&egrave;tres r&eacute;glables? Peut-on
configurer les d&eacute;lais (pour d&eacute;clarer un noeud comme en panne
ou effectuer la reprise), le nombre d'essais pour les actions correctrices
?
<h4>
4.1.1.2.&nbsp;Disponibilit&eacute;
des donn&eacute;es</h4></UL>

<div><b><u>Support du RAID :</u></b></div>


<UL><LI>RAID
logiciel. Types de RAID support&eacute;s (0,1,5) ;</UL>

<UL><LI>RAID
mat&eacute;riel. Types de RAID support&eacute;s. Liste des solutions mat&eacute;rielles
support&eacute;es. En particulier on v&eacute;rifiera l'existence de m&eacute;canismes
de remont&eacute;e d'erreur pris en charge par le produit de haute disponibilit&eacute;
et le support du "hot-swap".</UL>

<p><b><u>Disques partag&eacute;s physiquement entre plusieurs
noeuds:</u></b>

<UL><LI>Liste
des produits support&eacute;s ;</UL>

<UL><LI>Acc&egrave;s
concurrent : Plusieurs noeuds peuvent-ils acc&eacute;der simultan&eacute;ment
au disque, quelles sont les restrictions (par exemple acc&egrave;s en &eacute;criture
limit&eacute; &agrave; un seul noeud) ;</UL>

<UL><LI>Nombre
de noeuds support&eacute;s : il s'agit du nombre de noeuds pouvant &ecirc;tre
reli&eacute;s simultan&eacute;ment aux disques.</UL>

<p><b><u>Volumes partag&eacute;s :</u></b>

<UL><LI>Utilisation
de volumes distants ou r&eacute;plication de volumes locaux sur un noeud
diff&eacute;rent ;</UL>

<UL><LI>Acc&egrave;s
concurrents ;</UL>

<UL><LI>Existence
d'un m&eacute;canisme de resynchronisation apr&egrave;s une d&eacute;connexion
ou une panne ;</UL>

<UL><LI>Nombre
de noeuds support&eacute;s : nombre de noeuds pouvant &ecirc;tre reli&eacute;s
simultan&eacute;ment aux disques.</UL>

<p><b><u>Haute disponibilit&eacute; des syst&egrave;mes
de fichiers :</u></b>

<UL><LI>Maintien
de l'&eacute;tat d'un syst&egrave;me de fichiers distant apr&egrave;s une
panne du noeud l'h&eacute;bergeant (par exemple conservation des verrous
dans le cas de NFS) ;</UL>

<UL><LI>Support
de syst&egrave;mes de fichiers journalis&eacute;s.
<h4>
4.1.1.3.&nbsp;Equilibrage
de charge</h4></UL>

<div>Les points suivants seront &eacute;valu&eacute;s
:</div>


<UL><LI>Haute
disponibilit&eacute; du m&eacute;canisme d'&eacute;quilibrage de charge
;</UL>

<UL><LI>Services
support&eacute;s (services r&eacute;seau TCP/IP, autres ?) ;</UL>

<UL><LI>Crit&egrave;res
de "dispatching" support&eacute;s : quels crit&egrave;res sont possibles
pour s&eacute;lectionner le noeud traitant une requ&ecirc;te (Round Robin,
hasard, s&eacute;lection selon ressources disponibles? Peut-on envoyer
toutes les requ&ecirc;tes d'un client vers un seul noeud?) ;</UL>

<UL><LI>Ressources
surveill&eacute;es et utilis&eacute;es dans les crit&egrave;res de dispatching
(CPU utilis&eacute;, charge, nombre de connexions?) ;</UL>

<UL><LI>D&eacute;tection
des noeuds en panne. Le produit ne doit pas aiguiller une requ&ecirc;te
vers un noeud en panne.</UL>

<UL><LI>M&eacute;canismes
support&eacute;s (NAT, <i>tunneling</i>, routage direct?)
<h4>
4.1.1.4.&nbsp;Redondance
mat&eacute;rielle&nbsp;locale</h4></UL>

<div>Le support des produits &eacute;tudi&eacute;es sera
&eacute;valu&eacute; pour les solutions mat&eacute;rielles suivantes :</div>


<UL><LI>Support
des mat&eacute;riels hautement disponibles (liste des p&eacute;riph&eacute;riques
redondants et "hot-swappables"). Impact sur les applications ;</UL>

<UL><LI>Support
des solution mat&eacute;rielles de <i>watchdog</i>. Liste des produits
support&eacute;s ;</UL>

<UL><LI>Gestion
des onduleurs (d&eacute;tection coupure, consultation de la batterie, gestion
du red&eacute;marrage ?) ;</UL>

<UL><LI>Support
des solutions mat&eacute;rielles permettant de d&eacute;clencher le d&eacute;marrage,
le red&eacute;marrage ou l'arr&ecirc;t d'un noeud &agrave; distance.
<h4>
4.1.1.5.&nbsp;Redondance
multi-sites</h4></UL>

<div>Les points suivants seront &eacute;valu&eacute;s
:</div>


<UL><LI>M&eacute;canismes
de synchronisation de donn&eacute;es entre sites (synchrone, asynchrone
?) ;</UL>

<UL><LI>M&eacute;canismes
de reprise multi-sites
<h3>
4.1.2.&nbsp;Crit&egrave;res
g&eacute;n&eacute;raux</h3></UL>

<div>Ces crit&egrave;res ne sont pas associ&eacute;s
&agrave; des fonctionnalit&eacute;s particuli&egrave;res, mais permettent
une &eacute;valuation d'ensemble des produits. Ils concernent :</div>


<UL><LI>La
notori&eacute;t&eacute; du produit et de l?&eacute;diteur ;</UL>

<UL><LI>La
qualit&eacute; technique du produit ;</UL>

<UL><LI>L'administrabilit&eacute;
du produit ;</UL>

<UL><LI>Le
maintien en conditions op&eacute;rationnelles ;</UL>

<UL><LI>Les
aspects financiers et juridiques.</UL>

<p>

<p>Ces crit&egrave;res sont d&eacute;taill&eacute;s ci-dessous
:

<p><b><u>Notori&eacute;t&eacute; :</u></b>

<p>Appr&eacute;ciation
de la notori&eacute;t&eacute; du produit et de la soci&eacute;t&eacute;
qui l'&eacute;dite.

<p>Les r&eacute;f&eacute;rences
connues du produit seront prises en compte.

<p><b><u>Qualit&eacute;
technique du produit :</u></b>

<p>Synth&egrave;se
de la qualit&eacute; des produits sur le plan technique.

<p>En particulier,
les sous-crit&egrave;res suivants seront &eacute;valu&eacute;s :

<UL><LI>Robustesse
;</UL>

<UL><LI>S&eacute;curit&eacute;
: ce crit&egrave;re estime les probl&egrave;mes de s&eacute;curit&eacute;
pos&eacute;s par l'utilisation des produits &eacute;tudi&eacute;s. Les
questions de s&eacute;curit&eacute; sont pr&eacute;sent&eacute;s plus en
d&eacute;tail dans la partie&nbsp;3.3).</UL>

<p><b><u>Administration
et exploitation :</u></b>

<p>Les points suivants seront jug&eacute;s :

<UL><LI>Configuration
&agrave; chaud (y compris ajout et suppression de noeuds dans un cluster)
;</UL>

<UL><LI>Configuration
centralis&eacute;e ;</UL>

<UL><LI>Console
d'exploitation centralis&eacute;e ;</UL>

<UL><LI>M&eacute;canismes
d'alertes (SNMP, notification des utilisateurs, m&eacute;thodes externes
: E-Mail, pager, t&eacute;l&eacute;phone ?) ;</UL>

<UL><LI>Existence
d'une API (pour la configuration, remont&eacute;e de l'&eacute;tat du cluster,
et d&eacute;clenchement de basculement) ;</UL>

<UL><LI>Centralisation
de la configuration des syst&egrave;mes d'exploitation des diff&eacute;rents
noeuds (nommage, param&eacute;trage ?).</UL>

<p><b><u>Maintien en conditions op&eacute;rationnelles
:</u></b>

<p>Ce crit&egrave;re
constitue une synth&egrave;se des sous-crit&egrave;res suivants :

<UL><LI>Documentation
: &eacute;valuation de la qualit&eacute; et de la compl&eacute;tude de
la documentation du produit, ainsi que de l'existence d'une aide en ligne
int&eacute;gr&eacute;e au produit ou disponible sur le Web ;</UL>

<UL><LI>Support
: existence et qualit&eacute; du support ;</UL>

<UL><LI>Prise
en main : facilit&eacute; de prise en main du produit.
<h3>
4.1.3.&nbsp;Notation</h3></UL>

<div>Cette
partie d&eacute;crit la m&eacute;thode d'&eacute;valuation et de comparaison
des produits, et la mani&egrave;re dont les r&eacute;sultats seront pr&eacute;sent&eacute;s.</div>


<p>On
comparera trois solutions d&eacute;crites ci-dessous :

<UL><LI>AIX/HACMP
;</UL>

<UL><LI>Digital
Unix/TruClusters ;</UL>

<UL><LI>Logiciels
libres : l'ensemble des produits d&eacute;crits dans ce document. Pour
chacun des crit&egrave;res fonctionnels, on rappellera quels sont les produits
concern&eacute;s.</UL>

<p>

<p>Pour
chacune des solutions sont &eacute;valu&eacute;s :

<UL><LI>Les
sous-crit&egrave;res : &agrave; chacun d'eux sera associ&eacute;e une notation
qui d&eacute;pendra du sous-crit&egrave;re. Elle pourra &ecirc;tre <b>+
</b>si la fonctionnalit&eacute; est pr&eacute;sente et impl&eacute;ment&eacute;e
de fa&ccedil;on satisfaisante, <b>-</b> pour indiquer que la fonctionnalit&eacute;
n'est pas impl&eacute;ment&eacute;e ou de mani&egrave;re non satisfaisante.
On indiquera <b>n/a</b> si la fonctionnalit&eacute; ne s'applique pas,
et pas de notation si la fonctionnalit&eacute; n'a pu &ecirc;tre &eacute;valu&eacute;e.
On pourra aussi associer &agrave; un sous-crit&egrave;re une &eacute;valuation
informelle, par exemple une valeur num&eacute;rique pour le sous-crit&egrave;re
"nombre de noeuds support&eacute;s".</UL>

<UL><LI>Les
crit&egrave;res (fonctionnels ou g&eacute;n&eacute;raux) : &agrave; chacun
des crit&egrave;res sera associ&eacute;e une note&nbsp;<b>*</b>,<b>**</b>,<b>***</b>
selon que l'&eacute;valuation du crit&egrave;re correspondant est mauvaise,
moyenne ou bonne. Cette note sera d&eacute;duite des &eacute;valuations
des sous-crit&egrave;res d&eacute;pendant de ce crit&egrave;re.</UL>

<p>

<p>Ces
notations seront r&eacute;capitul&eacute;es sous la forme de deux tableaux
:

<UL><LI>Un
tableau d'&eacute;valuation pr&eacute;sentant l'ensemble des crit&egrave;res
et de leurs sous-crit&egrave;res ;</UL>

<UL><LI>Un
tableau de synth&egrave;se ne montrant que les crit&egrave;res.</UL>

<p>

<p>Les
colonnes de ces tableaux sont les suivantes :

<UL><LI>Crit&egrave;res
: crit&egrave;res ou sous-crit&egrave;res &eacute;valu&eacute;s ;</UL>

<UL><LI>HACMP
/ Trucluster / Logiciel libres : notation du crit&egrave;re ou sous-crit&egrave;re
comme pr&eacute;sent&eacute; ci-dessus ;</UL>

<UL><LI>Produits
: dans le cas des crit&egrave;res fonctionnels, cette colonne indique quels
sont les produits concern&eacute;s par la fonction associ&eacute;e au crit&egrave;re
;</UL>

<UL><LI>Remarques
: Cette rubrique pr&eacute;cise la notation de la solution logiciels libres
et peut &eacute;ventuellement pr&eacute;senter des &eacute;l&eacute;ments
de comparaison avec les autres solutions.
<h2>
4.2.&nbsp;Tableaux
de comparaison</h2></UL>

<div>Cette
partie contient les tableaux d'&eacute;valuation et de synth&egrave;se
d&eacute;crits en&nbsp;4.1.3.</div>


<p></div>

<br>
<div class=Section2>
<div>Tableau&nbsp;1
: R&eacute;sultat de l'&eacute;valuation</div>

<br>&nbsp;
<table BORDER CELLSPACING=0 CELLPADDING=0 >
<caption><thead>
<br></thead></caption>

<tr>
<td VALIGN=TOP ROWSPAN="2" WIDTH="211">
<center><B>Crit&egrave;res</B></center>
</td>

<td VALIGN=TOP COLSPAN="3" WIDTH="219">
<center><B>Evaluation</B></center>
</td>

<td VALIGN=TOP COLSPAN="2" WIDTH="548">
<center><b>Logiciel libre</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="68">
<center>HACMP</center>
</td>

<td VALIGN=TOP WIDTH="76">
<div>TruCluster</div>
</td>

<td VALIGN=TOP WIDTH="76">
<center>Log. Libre</center>
</td>

<td VALIGN=TOP WIDTH="95">
<center>Produits</center>
</td>

<td VALIGN=TOP WIDTH="454">
<center>Remarques</center>
</td>
</tr>

<tr>
<td VALIGN=TOP COLSPAN="6" WIDTH="978">
<center><b>Mise
en cluster</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

M&eacute;canismes
de reprise
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>*</b></center>
</td>

<td VALIGN=TOP ROWSPAN="5" WIDTH="95">
<div>Hearbeat</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Heartbeat fourni une solution "l&eacute;g&egrave;re"
de <i>clustering</i> pour deux serveurs. Ce produit est &agrave; compl&eacute;ter
par un outil de d&eacute;tection de pannes logicielles tel que Mon.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Modes de "clusterisation"
support&eacute;s</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Contrairement aux solutions commerciales, Heartbeat ne
supporte qu'un seul mode de reprise (voir description&nbsp;3.1.2).
En particulier, pas de failover en cascade, d'instances multiples de service?
. Heartbeat impose un basculement lorsque le noeud principal est disponible
apr&egrave;s une panne.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Nombre de noeuds support&eacute;s</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>32</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>8</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>2</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>La
documentation sur Heartbeat indique que la limitation &agrave; 2 noeuds
devrait &ecirc;tre bient&ocirc;t supprim&eacute;e (l'architecture du produit
est pr&eacute;vue pour un plus grand nombre de noeuds).</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>S&eacute;lection dynamique
du noeud de backup</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Cette fonction n'est pas impl&eacute;ment&eacute;e
dans Hearbeat et TruCluster.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Compatibilit&eacute; avec
les produits d'&eacute;quilibrage de charge</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Heartbeat ne supporte pas d'instances multiples de service.
Il n'est donc pas possible d'utiliser Heartbeat pour g&eacute;rer les serveurs
dans le cadre d'une solution d'&eacute;quilibrage de charge &agrave; l'aide
de ce produit.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Actions correctrices possibles</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="95">
<div></div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Actions possibles :</div>


<UL><LI>Reprise
d'adresse IP ;</UL>

<UL><LI>Reprise
d'un service (via script de d&eacute;marrage) ;</UL>

<UL><LI>Action
quelconque (script &agrave; fournir).</UL>

<p>En cas de panne d'une interface r&eacute;seau le produit
ne sait pas basculer sur une autre interface (sauf &agrave; d&eacute;velopper
cette fonction).

<p>Les trois produits sont &eacute;quivalents.</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

D&eacute;tection
de pannes
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP ROWSPAN="7" WIDTH="95">
<div>Heartbeat,
Mon</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Les logiciels libres &eacute;tudi&eacute;s permettent
de surveiller la plupart des ressources logicielles et mat&eacute;rielles.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>D&eacute;tection pannes
logicielles</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Mon permet de surveiller un grand nombre de services
r&eacute;seau (HTTP, LDAP?).</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>D&eacute;tection pannes
mat&eacute;rielles</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Les produits permettent de d&eacute;tecter des pannes
mat&eacute;rielle avec des m&eacute;canismes de "ping" (pour Mon) ou de
dialogue entre agents pr&eacute;sents sur les noeuds. Les trois produits
sont &eacute;quivalents.</div>


<p>On peut noter que Heartbeat dialogue par plusieurs m&eacute;thodes
simultan&eacute;ment (r&eacute;seau et port s&eacute;rie), ce qui lui permet
de distinguer les pannes r&eacute;seau et pannes compl&egrave;tes d'un
noeud.

<p>Le produit lm-sensors (non &eacute;tudi&eacute; dans ce
rapport) permet de contr&ocirc;ler les sondes de temp&eacute;rature, ventilateurs,
alimentation, pr&eacute;sent dans les mat&eacute;riels PC standards.</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>D&eacute;tection de probl&egrave;mes
de ressources</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>La
seule ressource qu'on sait surveiller (avec Mon) est l'espace disque, mais
on peut en ajouter en &eacute;crivant ses propres scripts.</div>


<p>Au
niveau des solutions commerciales, cette solution est impl&eacute;ment&eacute;e
dans le produit d'IBM mais pas celui de Digital.</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Interfaces (API)</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div><b>Heartbeat :</b> Il est possible de d&eacute;clencher
le basculement depuis une application par l'interm&eacute;diaire d'outils
en ligne de commande. L'API de consultation de l'&eacute;tat du cluster
est en cours de d&eacute;veloppement et pr&eacute;sente encore de gros
probl&egrave;mes de stabilit&eacute;.</div>


<p><b>Mon : </b>Mon est livr&eacute; avec un outil d'administration
en ligne de commande que l'ont peut ex&eacute;cuter sur le noeud du serveur
Mon ou &agrave; distance. Les fonctions de l'outil sont d&eacute;crites
en&nbsp;3.1.3.
Le produit est livr&eacute; avec des exemples de scripts utilisant cet
outil.

<p>Les APIs des produits commerciaux sont plus homog&egrave;nes.</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Extensibilit&eacute;</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div><b>Heartbeat :</b> On peut ajouter des actions &agrave;
d&eacute;clencher lors du basculement.</div>


<p><b>Mon :</b> On peut ajouter des scripts de surveillance
de nouvelles resources ou des scripts &agrave; d&eacute;clencher en cas
d'alerte.&nbsp;

<p>Les trois produits sont &eacute;quivalents.</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>R&eacute;glages possibles</div>
</td>

<td VALIGN=TOP WIDTH="68">
<div></div>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Tous les intervalles de surveillance, le nombre d'&eacute;checs
avant alerte ou basculement sont param&eacute;trables.</div>


<p>Dans le cas de Mon on peut d&eacute;finir des d&eacute;pendances
entre les resources partag&eacute;es pour limiter le nombre d'alarmes.</td>
</tr>

<tr>
<td VALIGN=TOP COLSPAN="6" WIDTH="978">
<center><b>Disponibilit&eacute; des donn&eacute;es</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

Support
RAID
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>**</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>**</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>**</b></center>
</td>

<td VALIGN=TOP ROWSPAN="3" WIDTH="95">
<div>Linux</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Linux fournit une fonction de RAID logiciel tr&egrave;s
compl&egrave;te, mais supporte tr&egrave;s peu de solutions mat&eacute;rielles.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>RAID mat&eacute;riel</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Un seul produit (contr&ocirc;leur) support&eacute;
par Linux contrairement aux autres solutions..</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>RAID logiciel</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Tr&egrave;s complet pour Linux.</div>


<p>Pas support&eacute; par HACMP. Support limit&eacute;
par Digital (pas de Raid 5).</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

Disques
partag&eacute;s
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>**</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>**</b></center>
</td>

<td VALIGN=TOP ROWSPAN="4" WIDTH="95">
<div>GFS</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Solutions commerciales :</div>


<UL><LI>Compaq
supporte CFS (Cluster File System) ;</UL>

<UL><LI>IBM
supporte la m&ecirc;me fonctionnalit&eacute; mais de fa&ccedil;on non conforme
&agrave; la norme POSIX.</UL>

<UL><LI>GFS
supporte peu de mat&eacute;riels.</td>
</tr></UL>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Produits support&eacute;s</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>GFS impose des limitations au mat&eacute;riel :
le disque ou la baie doivent supporter la sp&eacute;cification Dlock qui
est peu r&eacute;pandue, et les constructeurs qui l'ont impl&eacute;ment&eacute;
ne la supportent pas.</div>


<p>Support SCSI et Fibre Channel uniquement (pas de SSA).</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Acc&egrave;s concurrent
possible</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Note : GFS supporte la journalisation dans le cas
d'acc&egrave;s en &eacute;criture multiples, contrairement &agrave; la
solution d'IBM.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Nombre de noeuds support&eacute;s</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>8</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>16+</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>La mise en place de GFS la plus importante a utilis&eacute;
16 noeuds acc&eacute;dant de fa&ccedil;on concurrente &agrave; des disques
partag&eacute;s.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

Volumes
partag&eacute;s
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>*</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>*</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP ROWSPAN="5" WIDTH="95">
<div>DRBD</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Cette fonctionnalit&eacute; n'est pas impl&eacute;ment&eacute;e
dans les solutions commerciales o&ugrave; on utilise plut&ocirc;t des disques
partag&eacute;s.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>M&eacute;canisme de r&eacute;plication
de volumes / utilisation de volumes distants</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>n/a</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>n/a</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Le seul mode de fonctionnement support&eacute; par
DRBD est la r&eacute;plication &agrave; la vol&eacute;e.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Acc&egrave;s concurrent
possible</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>n/a</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>n/a</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Pas d'acc&egrave;s concurrent possible</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>M&eacute;canisme de resynchronisation
apr&egrave;s d&eacute;connexion</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>n/a</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>n/a</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>DRBD a 2 m&eacute;canismes :</div>


<UL><LI>resynchronisation
partielle d&eacute;clench&eacute;e automatiquement apr&egrave;s une d&eacute;connexion
temporaire (coupure r&eacute;seau ou panne du secondaire)</UL>

<UL><LI>resynchronisation
totale (recopie de l'ensemble du volume) : Son d&eacute;clenchement se
fait manuellement par un outil en ligne de commande.</UL>

<p>Les deux m&eacute;canismes fonctionnent en t&acirc;che de
fond.</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Nombre de noeuds support&eacute;s</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>n/a</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>n/a</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>2</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>La <i>roadmap</i> du produit indique que la limitation
a 2 noeuds sera supprim&eacute;e.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

Haute
disponibilit&eacute; des syst&egrave;mes de fichiers
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="95">
<div>ReiserFS</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>ReiserFs : Journalisation des m&eacute;ta-donn&eacute;es
uniquement (c'est aussi le cas des solutions commerciales), ce qui correspond
&agrave; une utilisation courante.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Syst&egrave;mes de fichiers
journalis&eacute;s</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="95">
<div>ReiserFS</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Pour les solutions commerciales, la journalisation
est une fonction standard des syst&egrave;mes d'exploitations sur lesquelles
elles fonctionnent.</div>


<p>Note : plusieurs autres syst&egrave;mes de fichiers
journalis&eacute;s sont en cours de d&eacute;veloppement (XFS, JFS, ext3,
LinLogFS?)</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Haute disponibilit&eacute;
des syst&egrave;mes de fichiers</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="95">
<div><b><i>Aucun</i></b></div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>IBM fournit des fonctions de r&eacute;cup&eacute;ration
de l'&eacute;tat d'un syst&egrave;me de fichiers (verrous?) apr&egrave;s
un crash. Aucun des produits libres ne fournit de solution.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP COLSPAN="6" WIDTH="978">
<center><b>Equilibrage
de charge</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

Equilibrage
de charge
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<div></div>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP ROWSPAN="5" WIDTH="95">
<div>LVS</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>La solution commerciale consid&eacute;r&eacute;e pour
IBM est : Network Dispatcher pour IBM/HACMP</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Haute disponibilit&eacute;
du m&eacute;canisme d'&eacute;quilibrage de charge</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>&Ccedil;a n'est pas une fonction du produit de base :
il faut utiliser une des solutions Piranha ou Ultramonkey, ou cela doit
&ecirc;tre r&eacute;alis&eacute; par ailleurs.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Crit&egrave;res de "dispatching"
support&eacute;s</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Crit&egrave;res :</div>


<UL><LI>round
robin pond&eacute;r&eacute; ou pas,</UL>

<UL><LI>choix
du serveur avec le moins de connexions actives, pond&eacute;r&eacute; ou
pas.</UL>

<p>LVS ne supporte pas de crit&egrave;re d&eacute;pendant de
l'&eacute;tat des serveurs (charge, utilisation CPU ..) contrairement &agrave;
la solution d'IBM.</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>D&eacute;tection des noeuds
en panne</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Les solutions Piranha et Ultramonkey apportent cette
fonction.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>M&eacute;canismes support&eacute;s</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>LVM est la solution qui supporte le plus de m&eacute;canismes
de routage de paquets vers les serveurs. IBM ne supporte que le routage
direct.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP COLSPAN="6" WIDTH="978">
<div>Redondance
mat&eacute;rielle locale</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

Redondance
mat&eacute;rielle locale
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>**</b></center>
</td>

<td VALIGN=TOP WIDTH="95">
<div>Linux&nbsp;</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Rien n'est pr&eacute;vu parmi les logiciels libres,
&agrave; part la gestion des watchdogs et des onduleurs.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Support des mat&eacute;riels
hautement disponibles</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="95">
<div><b><i>Aucun</i></b></div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Pas de solution logiciel libre.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Gestion des onduleurs</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="95">
<div>Cf. remarque</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Il existe de nombreux produits dans le logiciel
libre permettant de g&eacute;rer les onduleurs et de d&eacute;clencher
des actions selon l'&eacute;tat de l'onduleur. Ces produits n'ont pas &eacute;t&eacute;
&eacute;tudi&eacute;s dans ce document.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Support des watchdogs</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="95">
<div>Linux</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Support&eacute; par Linux, mais le nombre de solutions
mat&eacute;rielles support&eacute;es est tr&egrave;s faible (3 produits).</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Support arr&ecirc;t+red&eacute;marrage
mat&eacute;riel</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<div></div>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="95">
<div><b><i>Aucun</i></b></div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Disponible sur HACMP mais pas de solution logiciel
libre.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP COLSPAN="6" WIDTH="978">
<center><b>Redondance
multi-site</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div><b>Redondance multi-site</b></div>
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>*</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>*</b></center>
</td>

<td VALIGN=TOP ROWSPAN="3" WIDTH="95">
<div><b><i>Aucun</i></b></div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Aucun logiciel libre ne fournit cette fonctionnalit&eacute;
(parmi les solutions commerciales, seul IBM fournit une fonction de reprise
multi-site sans limite de distance via un WAN).</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>M&eacute;canismes de synchronisation
de donn&eacute;es entre sites</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>n/a</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>n/a</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div></div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>M&eacute;canismes de reprise
de multi-sites</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>n/a</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>n/a</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div></div>
</td>
</tr>

<tr>
<td VALIGN=TOP COLSPAN="6" WIDTH="978">
<center><b>Crit&egrave;res
g&eacute;n&eacute;raux</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div><b>Notori&eacute;t&eacute;</b></div>
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>*</b></center>
</td>

<td VALIGN=TOP ROWSPAN="15" WIDTH="95">
<div>tous</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Les produits logiciels libres &eacute;tudi&eacute;s (&agrave;
part le syst&egrave;me Linux) pr&eacute;sentent peu de r&eacute;f&eacute;rences
&agrave; l'heure actuelle.</div>


<p>On peut citer l'utilisation de ReiserFS pour le serveur&nbsp;sourceforge.net
(850Go de fichiers en ligne dont la moiti&eacute; est sous ReiserFS).</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div><b>Qualit&eacute; technique</b></div>
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>**</b></center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Variable selon les logiciels libres utilis&eacute;s.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Robustesse</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Variable selon les produits. Certains produit n&eacute;cessitent
des corrections pour pouvoir fonctionner correctement. Par exemple dans
certaines circonstances, l'utilisation conjointe de DRBD et Heartbeat conduit
&agrave; des situations ou les deux noeuds essaient d'&ecirc;tre primaire
en m&ecirc;me temps, ce qui conduit au blocage du produit DRBD.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>S&eacute;curit&eacute;</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Voir partie&nbsp;3.3.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div><b>Administration et exploitation</b></div>
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>*</b></center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Adrminstration tr&egrave;s "Bas niveau" pour les
logiciels libres.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Configuration &agrave; chaud
possible</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Pas de configuration sans red&eacute;marrage des produits,
&agrave; part :</div>


<UL><LI>Retrait
temporaire d'un serveur d'un cluster Heartbeat possible ;</UL>

<UL><LI>Arr&ecirc;t
de la surveillance d'une ressource par Mon.</td>
</tr></UL>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Configuration centralis&eacute;e</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Aucune pour les logiciels libres.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>API d'administration</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Logiciels libres : en g&eacute;n&eacute;ral, administration
"&agrave; l'ancienne" : fichier de configuration et red&eacute;marrage
du produit pour prendre en compte les modifications.</div>


<p>Seul Mon fournit une vraie API.

<p>IBM fournit une API C/C++.</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Centralisation de la configuration
des syst&egrave;mes d'exploitation des diff&eacute;rents noeuds</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Utilisation des m&eacute;canismes standard Unix
pour les logiciels libres.</div>


<p>Les outils d'administration d'IBM permettent d'administrer
les syst&egrave;mes d'exploitation des diff&eacute;rents noeuds d'un cluster
de mani&egrave;re centralis&eacute;e (gestion des utilisateurs, nom des
serveurs ?)</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Console d'exploitation centralis&eacute;e</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>IBM fournit une console graphique pr&eacute;sentant
l'&eacute;tat des diff&eacute;rents noeuds d'o&ugrave; on peut d&eacute;clencher
des actions telles que le basculement d'un service, le d&eacute;marrage
ou l'arr&ecirc;t d'un noeud ?</div>


<p>Rien pour les logiciels libres.</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>M&eacute;canismes d'alertes</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Seul Mon est capable de remonter ses propres alertes.
N'existe pas sur les autres logiciels libres..</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div><b>Maintien en conditions
op&eacute;rationnelles</b></div>
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>**</b></center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Documentation "dense" et tr&egrave;s technique et
* support &raquo; par mailing-list pour les logiciels libres..</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Documentation</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Documentation type Man UNIX ou HOWTO, en g&eacute;n&eacute;ral
assez concise et pas du tout didactique, mais assez compl&egrave;te. Les
produits sont fournis avec des exemples de fichiers de configuration.</div>


<p>Le produit LVS se d&eacute;marque des autres en fournissant
une documentation en ligne de bonne qualit&eacute; contenant plusieurs
exemples de configuration.

<p>Bonne documentation pour HACMP.</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Support</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Pas de support officiel pour le logiciel libre,
mais il y a une mailing-list sur la haute disponibilit&eacute; (archive
avec outil de recherche et modalit&eacute;s d'inscription sur www.linux-ha.org)
&agrave; laquelle les d&eacute;veloppeurs des produits participent.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
<div>Prise en main</div>
</td>

<td VALIGN=TOP WIDTH="68">
<center>+</center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center>-</center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Les produits sont en g&eacute;n&eacute;ral simples
&agrave; installer (&agrave; part ReiserFS qui n&eacute;cessite un patch
noyau et dont la mise en place comme syst&egrave;me de fichier d'une distribution
existante peut &ecirc;tre d&eacute;licat) et &agrave; utiliser. Mais une
int&eacute;gration est n&eacute;cessaire pour les logiciels libres.</div>
</td>
</tr>
</table>


<p>
<br>
<br>

<p>Tableau&nbsp;2
: Synth&egrave;se de l'&eacute;valuation
<br>&nbsp;
<table BORDER CELLSPACING=0 CELLPADDING=0 >
<caption><thead>
<br></thead></caption>

<tr>
<td VALIGN=TOP ROWSPAN="2" WIDTH="211">
<center><b>Crit&egrave;res</b></center>
</td>

<td VALIGN=TOP COLSPAN="3" WIDTH="219">
<center><b>Notation</b></center>
</td>

<td VALIGN=TOP COLSPAN="2" WIDTH="548">
<center><b>Synth&egrave;se logiciel libre</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="68">
<center>HACMP</center>
</td>

<td VALIGN=TOP WIDTH="76">
<div>TruCluster</div>
</td>

<td VALIGN=TOP WIDTH="76">
<center>Log. libre</center>
</td>

<td VALIGN=TOP WIDTH="95">
<center>Produits</center>
</td>

<td VALIGN=TOP WIDTH="454">
<center>Remarques</center>
</td>
</tr>

<tr>
<td VALIGN=TOP COLSPAN="6" WIDTH="978">
<center><b>Mise
en cluster</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

M&eacute;canismes
de reprise
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>*</b></center>
</td>

<td VALIGN=TOP WIDTH="95">
<div>Heartbeat</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Heartbeat fournit une solution "l&eacute;g&egrave;re"
de clustering pour deux serveurs.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

D&eacute;tection
de panne
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="95">
<div>Heartbeat, Mon</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Les logiciels libres &eacute;tudi&eacute;s permettent
de surveiller la plupart des ressources logicielles et mat&eacute;rielles.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP COLSPAN="6" WIDTH="978">
<center><b>Disponibilit&eacute; des donn&eacute;es</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

Support
RAID
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>**</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>**</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>**</b></center>
</td>

<td VALIGN=TOP WIDTH="95">
<div>Linux</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>RAID logiciel plus complet que les solutions commerciales.
RAID mat&eacute;riel supporte peu de contr&ocirc;leurs.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

Disques
partag&eacute;s
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>**</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>**</b></center>
</td>

<td VALIGN=TOP WIDTH="95">
<div>GFS</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Produit complet mais avec des contraintes importantes
sur le mat&eacute;riel (support d'une extension &agrave; la norme SCSI).</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

Volumes
partag&eacute;s
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>*</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>*</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="95">
<div>DRBD</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>DRBD fournit une fonction de r&eacute;plication de disque
au fil de l'eau et n'a pas d'&eacute;quivalents dans les solutions commerciales.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

Haute
disponibilit&eacute; des syst&egrave;mes de fichiers
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="95">
<div>ReiserFS</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>ReiserFS est d&eacute;j&agrave; utilis&eacute; en
production sur plusieurs gros serveurs.&nbsp;</div>
</td>
</tr>

<tr>
<td VALIGN=TOP COLSPAN="6" WIDTH="978">
<center><b>Equilibrage
de charge</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

Equilibrage
de charge
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="95">
<div>LVS</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>LVS est disponible sous forme de solutions compl&egrave;tes,les
outils administration viennent de sortir.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP COLSPAN="6" WIDTH="978">
<div>Redondance
mat&eacute;rielle locale</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">

Redondance
mat&eacute;rielle locale
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>**</b></center>
</td>

<td VALIGN=TOP WIDTH="95">
<div>Linux&nbsp;</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Linux ne supporte pas la plupart des mat&eacute;riels
redondants, mais permet de g&eacute;rer les onduleurs et les watchdogs.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP COLSPAN="6" WIDTH="978">
<center><b>Redondance
multi-site</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
Redondance multi-site
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>*</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>*</b></center>
</td>

<td VALIGN=TOP WIDTH="95">
<div><b><i>Aucun</i></b></div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Aucun logiciel libre ne fournit cette fonctionnalit&eacute;
(parmi les solutions commerciales, seul IBM fournit une fonction de reprise
multi-site sans limite de distance via un WAN).</div>
</td>
</tr>

<tr>
<td VALIGN=TOP COLSPAN="6" WIDTH="978">
<center><b>Crit&egrave;res
g&eacute;n&eacute;raux</b></center>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
Notori&eacute;t&eacute;
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>*</b></center>
</td>

<td VALIGN=TOP ROWSPAN="4" WIDTH="95">
<div>Tous</div>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Tr&egrave;s peu de r&eacute;f&eacute;rences en production
actuellement (&agrave; part Linux).</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
Qualit&eacute; technique
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>**</b></center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Variable selon les produits.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
Administration
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>*</b></center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Adrminstration tr&egrave;s "Bas niveau" pour les
logiciels libres &agrave; l'exception des deux solutions int&eacute;grant
LVS.</div>
</td>
</tr>

<tr>
<td VALIGN=TOP WIDTH="211">
Maintien en conditions
op&eacute;rationnelles
</td>

<td VALIGN=TOP WIDTH="68">
<center><b>***</b></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center></center>
</td>

<td VALIGN=TOP WIDTH="76">
<center><b>**</b></center>
</td>

<td VALIGN=TOP WIDTH="454">
<div>Documentation "dense" et tr&egrave;s technique et
support par mailing-list.</div>
</td>
</tr>
</table>
</div>

<br>
<div class=Section3>
<h2>
4.3.&nbsp;Synth&egrave;se</h2>

<div>On constate que dans l'environnement des logiciels
libres on trouve encore peu de produits fournissant une solution globale
de haute disponibilit&eacute;, et que pour mettre en place une telle solution
il faut utiliser plusieurs "petits" produits apportant chacun une fonction
de la haute disponibilit&eacute; (<i>clustering</i>, r&eacute;plication
de disques, RAID, ?). Les produits doivent ensuite &ecirc;tre int&eacute;gr&eacute;s.</div>


<p>Les distributions Linux incluent rarement des outils
de haute disponibilit&eacute;. Il faut donc installer ces produits soi-m&ecirc;me
et les int&eacute;grer au syst&egrave;me d'exploitation. Par exemple, dans
le cas de ReiserFS, cette op&eacute;ration est tr&egrave;s lourde : elle
n&eacute;cessite l'installation d'une distribution, la sauvegarde compl&egrave;te,
le repartitionnement et mise en place des partitions ReiserFS, la restauration
du syst&egrave;me, et la mise &agrave; jour "&agrave; la main" des fichiers
de configuration du syst&egrave;me, &eacute;tant donn&eacute; que ReiserFS
n'est pas pris en compte par les outils d'administration livr&eacute; avec
la distribution. Les seules exceptions sont :

<UL><LI>Redhat
(www.redhat.com)
qui inclut maintenant le produit Piranha dans sa distribution ;</UL>

<UL><LI>La
distribution Suse 6.4 (www.suse.com)
qui peut s'installer sur un syst&egrave;me de fichier ReiserFS ;</UL>

<UL><LI>La
distribution Conectiva Linux qui comprend le produit Heartbeat.</UL>

<p>

<p>Faiblesses des produits :

<UL><LI>La
s&eacute;curit&eacute; a &eacute;t&eacute; prise en compte de mani&egrave;re
in&eacute;gale par les produits &eacute;tudi&eacute;s. En particulier le
produit DRBD fait circuler en clair sur le r&eacute;seau et sans authentification
toutes les mises &agrave; jour apport&eacute;es au contenu de la partition
partag&eacute;e. La mise en place d'une solution de haute disponibilit&eacute;
s&eacute;curis&eacute;e passe par des solutions de type s&eacute;curit&eacute;
de p&eacute;rim&egrave;tre telles que celles d&eacute;crite dans la partie&nbsp;3.3
;</UL>

<UL><LI>Les
produits ne fournissent pas d'outil d'administration de haut niveau &agrave;
part pour les deux solutions d'&eacute;quilibrage de charge toutes int&eacute;gr&eacute;es
(Ultramonkey et Piranha) ;</UL>

<UL><LI>Les
produits &eacute;tudi&eacute;s n'ont pratiquement pas de r&eacute;f&eacute;rences
en production actuellement, &agrave; part l'utilisation des fonctions standard
de Linux (RAID, <i>Watchdog</i>), et le produit ReiserFS ;</UL>

<UL><LI>Les
produits &eacute;tudi&eacute;s pr&eacute;sentent des limitations tr&egrave;s
contraignantes (par exemple le nombre de noeuds support&eacute;s par HeartBeat
et DRBD), mais les auteurs annoncent que ces limitations vont &ecirc;tre
supprim&eacute;es dans des versions ult&eacute;rieure. En particulier,
dans le domaine de la mise en cluster : le produit Heartbeat ne supporte
que 2 noeuds, n'a pas de m&eacute;canisme de d&eacute;tection et de reprise
dans le cas d'une panne d'une interface r&eacute;seau. Aucun produit n'adresse
actuellement le probl&egrave;me de redondance entre sites distants multiples.
La vitesse d'&eacute;volution des produits et le nombre d'intervenants
participant &agrave; ces projets semblent aller dans ce sens.</UL>

<p>

<p>Les logiciels libres offrent des solutions de qualit&eacute;
comparable (&agrave; part pour les outils d'administration) avec les produits
commerciaux dans les domaines suivants :

<UL><LI>RAID
mat&eacute;riel et logiciel</UL>

<UL><LI>Disques
partag&eacute;s (GFS)</UL>

<UL><LI>Equilibrage
de charge (LVS)</UL>

<p>

<p>Les logiciels libres permettent la mise en place de
solutions hautement disponibles sur du mat&eacute;riel &agrave; faible
co&ucirc;t (PC standard) :

<UL><LI>Une
solution de r&eacute;plication de disques &agrave; la vol&eacute;e permet
d'assurer la haute disponibilit&eacute; des donn&eacute;es la ou une solution
commerciale &eacute;quivalente n&eacute;cessite la mise en place de disques
partag&eacute;s et donc de mat&eacute;riel sp&eacute;cifique (Fibre Channel
?) ;</UL>

<UL><LI>La
solution de RAID logiciel fournie par Linux est plus compl&egrave;te que
celles fournies par les solutions commerciales. Certaines fonctionnalit&eacute;s
(RAID 5 par exemple) qu'elle fournit n&eacute;cessitent forc&eacute;ment
la mise en place d'une solution mat&eacute;rielle sp&eacute;cifique dans
le cas des solutions commerciales.</UL>

<p>

<p>En conclusion, les solutions de haute disponibilit&eacute;
dans l'environnement logiciel libre n'ont pas encore atteint le stade de
la maturit&eacute;. On peut toutefois affirmer que la haute disponibilit&eacute;
est une r&eacute;alit&eacute; satisfaisante pour Linux si on se limite
&agrave; des cas simples, et en particulier au cas le plus couramment utilis&eacute;
qui est le backup d'un serveur sur un autre avec un partage de disques.
<h1>
5.&nbsp;Le
futur</h1>

<div>Les &eacute;diteurs de distributions incluent de
plus en plus des produits concernant la haute disponibilit&eacute; dans
leurs distributions :</div>


<UL><LI>Redhat
propose le produit Piranha et l'inclut dans sa distribution;</UL>

<UL><LI>La
distribution Suse peut s'installer sur du ReiserFS ;</UL>

<UL><LI>Conectiva
Linux (www.conectiva.com)
est livr&eacute; avec Heartbeat.</UL>

<p>On voit un nombre croissant d'annonces de soci&eacute;t&eacute;s
commerciales qui prennent en compte le probl&egrave;me de la haute disponibilit&eacute;
et vont proposer (ou proposent d&eacute;j&agrave;) des solutions compl&egrave;tes,
des nouveaux produits, ou la mise sous licence <i>open source</i> de leurs
produits d&eacute;j&agrave; existants. On peut citer les exemples suivants
:

<UL><LI>IBM
a diffus&eacute; une version de son syst&egrave;me de fichier journalis&eacute;
(JFS) pour Linux, mais le produit n'est pas encore utilisable (version
0.0.5 et beaucoup de fonctionnalit&eacute;s manquent). IBM a annonc&eacute;
la disponibilit&eacute; prochaine de son gestionnaire de volumes (LVM)
qui permet de g&eacute;rer les partitions disques sans interruption de
service (cela inclut les d&eacute;placement, redimensionnement, etc..).</UL>

<UL><LI>Silicon
Graphics fournit d&eacute;j&agrave; son syst&egrave;me de fichier journalis&eacute;
(XFS) mais ce produit n'est pas encore utilisable. SGI a annonce, en coop&eacute;ration
avec Suse, la disponibilit&eacute; prochaine (&eacute;t&eacute; 2000) de
son produit FailSafe sous licence<i> open source</i>.</UL>

<UL><LI>La
soci&eacute;t&eacute; de services MissionCriticalLinux (www.missioncriticallinux.com)
qui propose des solutions centr&eacute;s autour de la haute disponibilit&eacute;
sous Linux a annonc&eacute; fin Mars son intention de proposer des solutions
sp&eacute;cifiques aux march&eacute;s financiers. Cette soci&eacute;t&eacute;
vient d'annoncer la mise sous licence GPL de son produit Kimberlite Clustering
Technology, qui inclut en particulier le support des disques partag&eacute;s
et le support des commande &agrave; distances pour le red&eacute;marrage
des serveurs.</UL>

<UL><LI>VA-Linux
d&eacute;veloppe le produit Ultramonkey et a r&eacute;alis&eacute; une
d&eacute;monstration de cluster bas&eacute; sur GFS ;</UL>

<p>Les
<i>mailing-lists</i> et forums de discussions traitant des solutions libres
pour la haute disponibilit&eacute; enregistrent un fort trafic traitant
en particulier des points suivants :

<UL><LI>Mise
au point et &eacute;volutions des produits existant ;</UL>

<UL><LI>Discussions
pour la cr&eacute;ation de nouveaux produits (par exemple actuellement
une API de gestion des commandes &agrave; distances pour d&eacute;clencher
le red&eacute;marrage d'un serveur depuis une application est en cours
de d&eacute;finition).</UL>

<p>

<p>L'agitation
des d&eacute;veloppeurs et des soci&eacute;t&eacute;s commerciales autour
de la haute disponibilit&eacute; sur Linux et les logiciels libres montre
qu'il existe une forte attente dans ce domaine et nous assure d'avoir rapidement
des produits ad&eacute;quats pour apporter &agrave; cet environnement des
solutions plus performantes que les meilleures offres commerciales disponibles
aujourd'hui sur le march&eacute;.

<p></div>

</body>
</html>
